Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/pio/sama5d29.h
#define PIO_PD21E_I2SC0_WS                         (_UINT32_(1) << 21) /**< I2SC0 signal: I2SC0_WS */
/* ========== PIO definition for I2SC1 peripheral ========== */
#define PIN_PA15D_I2SC1_CK                         _UINT32_(15) /**< I2SC1 signal: I2SC1_CK on PA15 mux D */
#define MUX_PA15D_I2SC1_CK                         _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_CK */
#define PIO_PA15D_I2SC1_CK                         (_UINT32_(1) << 15) /**< I2SC1 signal: I2SC1_CK */
#define PIN_PB15D_I2SC1_CK                         _UINT32_(47) /**< I2SC1 signal: I2SC1_CK on PB15 mux D */
#define MUX_PB15D_I2SC1_CK                         _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_CK */
#define PIO_PB15D_I2SC1_CK                         (_UINT32_(1) << 15) /**< I2SC1 signal: I2SC1_CK */
#define PIN_PA17D_I2SC1_DI0                        _UINT32_(17) /**< I2SC1 signal: I2SC1_DI0 on PA17 mux D */
#define MUX_PA17D_I2SC1_DI0                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_DI0 */
#define PIO_PA17D_I2SC1_DI0                        (_UINT32_(1) << 17) /**< I2SC1 signal: I2SC1_DI0 */
#define PIN_PB17D_I2SC1_DI0                        _UINT32_(49) /**< I2SC1 signal: I2SC1_DI0 on PB17 mux D */
#define MUX_PB17D_I2SC1_DI0                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_DI0 */
#define PIO_PB17D_I2SC1_DI0                        (_UINT32_(1) << 17) /**< I2SC1 signal: I2SC1_DI0 */
#define PIN_PA18D_I2SC1_DO0                        _UINT32_(18) /**< I2SC1 signal: I2SC1_DO0 on PA18 mux D */
#define MUX_PA18D_I2SC1_DO0                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_DO0 */
#define PIO_PA18D_I2SC1_DO0                        (_UINT32_(1) << 18) /**< I2SC1 signal: I2SC1_DO0 */
#define PIN_PB18D_I2SC1_DO0                        _UINT32_(50) /**< I2SC1 signal: I2SC1_DO0 on PB18 mux D */
#define MUX_PB18D_I2SC1_DO0                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_DO0 */
#define PIO_PB18D_I2SC1_DO0                        (_UINT32_(1) << 18) /**< I2SC1 signal: I2SC1_DO0 */
#define PIN_PA14D_I2SC1_MCK                        _UINT32_(14) /**< I2SC1 signal: I2SC1_MCK on PA14 mux D */
#define MUX_PA14D_I2SC1_MCK                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_MCK */
#define PIO_PA14D_I2SC1_MCK                        (_UINT32_(1) << 14) /**< I2SC1 signal: I2SC1_MCK */
#define PIN_PB14D_I2SC1_MCK                        _UINT32_(46) /**< I2SC1 signal: I2SC1_MCK on PB14 mux D */
#define MUX_PB14D_I2SC1_MCK                        _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_MCK */
#define PIO_PB14D_I2SC1_MCK                        (_UINT32_(1) << 14) /**< I2SC1 signal: I2SC1_MCK */
#define PIN_PA16D_I2SC1_WS                         _UINT32_(16) /**< I2SC1 signal: I2SC1_WS on PA16 mux D */
#define MUX_PA16D_I2SC1_WS                         _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_WS */
#define PIO_PA16D_I2SC1_WS                         (_UINT32_(1) << 16) /**< I2SC1 signal: I2SC1_WS */
#define PIN_PB16D_I2SC1_WS                         _UINT32_(48) /**< I2SC1 signal: I2SC1_WS on PB16 mux D */
#define MUX_PB16D_I2SC1_WS                         _UINT32_(3)  /**< I2SC1 signal line function value: I2SC1_WS */
#define PIO_PB16D_I2SC1_WS                         (_UINT32_(1) << 16) /**< I2SC1 signal: I2SC1_WS */
/* ========== PIO definition for ICE peripheral ========== */
#define PIN_PA26C_ICE_NTRST                        _UINT32_(26) /**< ICE signal: ICE_NTRST on PA26 mux C */
#define MUX_PA26C_ICE_NTRST                        _UINT32_(2)  /**< ICE signal line function value: ICE_NTRST */
#define PIO_PA26C_ICE_NTRST                        (_UINT32_(1) << 26) /**< ICE signal: ICE_NTRST */
#define PIN_PD10A_ICE_NTRST                        _UINT32_(106) /**< ICE signal: ICE_NTRST on PD10 mux A */
#define MUX_PD10A_ICE_NTRST                        _UINT32_(0)  /**< ICE signal line function value: ICE_NTRST */
#define PIO_PD10A_ICE_NTRST                        (_UINT32_(1) << 10) /**< ICE signal: ICE_NTRST */
#define PIN_PD18A_ICE_NTRST                        _UINT32_(114) /**< ICE signal: ICE_NTRST on PD18 mux A */
#define MUX_PD18A_ICE_NTRST                        _UINT32_(0)  /**< ICE signal line function value: ICE_NTRST */
#define PIO_PD18A_ICE_NTRST                        (_UINT32_(1) << 18) /**< ICE signal: ICE_NTRST */
#define PIN_PD31B_ICE_NTRST                        _UINT32_(127) /**< ICE signal: ICE_NTRST on PD31 mux B */
#define MUX_PD31B_ICE_NTRST                        _UINT32_(1)  /**< ICE signal line function value: ICE_NTRST */
#define PIO_PD31B_ICE_NTRST                        (_UINT32_(1) << 31) /**< ICE signal: ICE_NTRST */
#define PIN_PA22C_ICE_TCK                          _UINT32_(22) /**< ICE signal: ICE_TCK on PA22 mux C */
#define MUX_PA22C_ICE_TCK                          _UINT32_(2)  /**< ICE signal line function value: ICE_TCK */
#define PIO_PA22C_ICE_TCK                          (_UINT32_(1) << 22) /**< ICE signal: ICE_TCK */
#define PIN_PD6A_ICE_TCK                           _UINT32_(102) /**< ICE signal: ICE_TCK on PD6 mux A */
#define MUX_PD6A_ICE_TCK                           _UINT32_(0)  /**< ICE signal line function value: ICE_TCK */
#define PIO_PD6A_ICE_TCK                           (_UINT32_(1) << 6) /**< ICE signal: ICE_TCK */
#define PIN_PD14A_ICE_TCK                          _UINT32_(110) /**< ICE signal: ICE_TCK on PD14 mux A */
#define MUX_PD14A_ICE_TCK                          _UINT32_(0)  /**< ICE signal line function value: ICE_TCK */
#define PIO_PD14A_ICE_TCK                          (_UINT32_(1) << 14) /**< ICE signal: ICE_TCK */
#define PIN_PD27B_ICE_TCK                          _UINT32_(123) /**< ICE signal: ICE_TCK on PD27 mux B */
#define MUX_PD27B_ICE_TCK                          _UINT32_(1)  /**< ICE signal line function value: ICE_TCK */
#define PIO_PD27B_ICE_TCK                          (_UINT32_(1) << 27) /**< ICE signal: ICE_TCK */
#define PIN_PA23C_ICE_TDI                          _UINT32_(23) /**< ICE signal: ICE_TDI on PA23 mux C */
#define MUX_PA23C_ICE_TDI                          _UINT32_(2)  /**< ICE signal line function value: ICE_TDI */
#define PIO_PA23C_ICE_TDI                          (_UINT32_(1) << 23) /**< ICE signal: ICE_TDI */
#define PIN_PD7A_ICE_TDI                           _UINT32_(103) /**< ICE signal: ICE_TDI on PD7 mux A */
#define MUX_PD7A_ICE_TDI                           _UINT32_(0)  /**< ICE signal line function value: ICE_TDI */
#define PIO_PD7A_ICE_TDI                           (_UINT32_(1) << 7) /**< ICE signal: ICE_TDI */
#define PIN_PD15A_ICE_TDI                          _UINT32_(111) /**< ICE signal: ICE_TDI on PD15 mux A */
#define MUX_PD15A_ICE_TDI                          _UINT32_(0)  /**< ICE signal line function value: ICE_TDI */
#define PIO_PD15A_ICE_TDI                          (_UINT32_(1) << 15) /**< ICE signal: ICE_TDI */
#define PIN_PD28B_ICE_TDI                          _UINT32_(124) /**< ICE signal: ICE_TDI on PD28 mux B */
#define MUX_PD28B_ICE_TDI                          _UINT32_(1)  /**< ICE signal line function value: ICE_TDI */
#define PIO_PD28B_ICE_TDI                          (_UINT32_(1) << 28) /**< ICE signal: ICE_TDI */
#define PIN_PA24C_ICE_TDO                          _UINT32_(24) /**< ICE signal: ICE_TDO on PA24 mux C */
#define MUX_PA24C_ICE_TDO                          _UINT32_(2)  /**< ICE signal line function value: ICE_TDO */
#define PIO_PA24C_ICE_TDO                          (_UINT32_(1) << 24) /**< ICE signal: ICE_TDO */
#define PIN_PD8A_ICE_TDO                           _UINT32_(104) /**< ICE signal: ICE_TDO on PD8 mux A */
#define MUX_PD8A_ICE_TDO                           _UINT32_(0)  /**< ICE signal line function value: ICE_TDO */
#define PIO_PD8A_ICE_TDO                           (_UINT32_(1) << 8) /**< ICE signal: ICE_TDO */
#define PIN_PD16A_ICE_TDO                          _UINT32_(112) /**< ICE signal: ICE_TDO on PD16 mux A */
#define MUX_PD16A_ICE_TDO                          _UINT32_(0)  /**< ICE signal line function value: ICE_TDO */
#define PIO_PD16A_ICE_TDO                          (_UINT32_(1) << 16) /**< ICE signal: ICE_TDO */
#define PIN_PD29B_ICE_TDO                          _UINT32_(125) /**< ICE signal: ICE_TDO on PD29 mux B */
#define MUX_PD29B_ICE_TDO                          _UINT32_(1)  /**< ICE signal line function value: ICE_TDO */
#define PIO_PD29B_ICE_TDO                          (_UINT32_(1) << 29) /**< ICE signal: ICE_TDO */
#define PIN_PA25C_ICE_TMS                          _UINT32_(25) /**< ICE signal: ICE_TMS on PA25 mux C */
#define MUX_PA25C_ICE_TMS                          _UINT32_(2)  /**< ICE signal line function value: ICE_TMS */
#define PIO_PA25C_ICE_TMS                          (_UINT32_(1) << 25) /**< ICE signal: ICE_TMS */
#define PIN_PD9A_ICE_TMS                           _UINT32_(105) /**< ICE signal: ICE_TMS on PD9 mux A */
#define MUX_PD9A_ICE_TMS                           _UINT32_(0)  /**< ICE signal line function value: ICE_TMS */
#define PIO_PD9A_ICE_TMS                           (_UINT32_(1) << 9) /**< ICE signal: ICE_TMS */
#define PIN_PD17A_ICE_TMS                          _UINT32_(113) /**< ICE signal: ICE_TMS on PD17 mux A */
#define MUX_PD17A_ICE_TMS                          _UINT32_(0)  /**< ICE signal line function value: ICE_TMS */
#define PIO_PD17A_ICE_TMS                          (_UINT32_(1) << 17) /**< ICE signal: ICE_TMS */
#define PIN_PD30B_ICE_TMS                          _UINT32_(126) /**< ICE signal: ICE_TMS on PD30 mux B */
#define MUX_PD30B_ICE_TMS                          _UINT32_(1)  /**< ICE signal line function value: ICE_TMS */
#define PIO_PD30B_ICE_TMS                          (_UINT32_(1) << 30) /**< ICE signal: ICE_TMS */
/* ========== PIO definition for ISC peripheral ========== */
#define PIN_PB26F_ISC_D0                           _UINT32_(58) /**< ISC signal: ISC_D0 on PB26 mux F */
#define MUX_PB26F_ISC_D0                           _UINT32_(5)  /**< ISC signal line function value: ISC_D0 */
#define PIO_PB26F_ISC_D0                           (_UINT32_(1) << 26) /**< ISC signal: ISC_D0 */
#define PIN_PC9C_ISC_D0                            _UINT32_(73) /**< ISC signal: ISC_D0 on PC9 mux C */
#define MUX_PC9C_ISC_D0                            _UINT32_(2)  /**< ISC signal line function value: ISC_D0 */
#define PIO_PC9C_ISC_D0                            (_UINT32_(1) << 9) /**< ISC signal: ISC_D0 */
#define PIN_PD7E_ISC_D0                            _UINT32_(103) /**< ISC signal: ISC_D0 on PD7 mux E */
#define MUX_PD7E_ISC_D0                            _UINT32_(4)  /**< ISC signal line function value: ISC_D0 */
#define PIO_PD7E_ISC_D0                            (_UINT32_(1) << 7) /**< ISC signal: ISC_D0 */
#define PIN_PB27F_ISC_D1                           _UINT32_(59) /**< ISC signal: ISC_D1 on PB27 mux F */
#define MUX_PB27F_ISC_D1                           _UINT32_(5)  /**< ISC signal line function value: ISC_D1 */
#define PIO_PB27F_ISC_D1                           (_UINT32_(1) << 27) /**< ISC signal: ISC_D1 */
#define PIN_PC10C_ISC_D1                           _UINT32_(74) /**< ISC signal: ISC_D1 on PC10 mux C */
#define MUX_PC10C_ISC_D1                           _UINT32_(2)  /**< ISC signal line function value: ISC_D1 */
#define PIO_PC10C_ISC_D1                           (_UINT32_(1) << 10) /**< ISC signal: ISC_D1 */
#define PIN_PD8E_ISC_D1                            _UINT32_(104) /**< ISC signal: ISC_D1 on PD8 mux E */
#define MUX_PD8E_ISC_D1                            _UINT32_(4)  /**< ISC signal line function value: ISC_D1 */
#define PIO_PD8E_ISC_D1                            (_UINT32_(1) << 8) /**< ISC signal: ISC_D1 */
#define PIN_PB28F_ISC_D2                           _UINT32_(60) /**< ISC signal: ISC_D2 on PB28 mux F */
#define MUX_PB28F_ISC_D2                           _UINT32_(5)  /**< ISC signal line function value: ISC_D2 */
#define PIO_PB28F_ISC_D2                           (_UINT32_(1) << 28) /**< ISC signal: ISC_D2 */
#define PIN_PC11C_ISC_D2                           _UINT32_(75) /**< ISC signal: ISC_D2 on PC11 mux C */
#define MUX_PC11C_ISC_D2                           _UINT32_(2)  /**< ISC signal line function value: ISC_D2 */
#define PIO_PC11C_ISC_D2                           (_UINT32_(1) << 11) /**< ISC signal: ISC_D2 */
#define PIN_PD9E_ISC_D2                            _UINT32_(105) /**< ISC signal: ISC_D2 on PD9 mux E */
#define MUX_PD9E_ISC_D2                            _UINT32_(4)  /**< ISC signal line function value: ISC_D2 */
#define PIO_PD9E_ISC_D2                            (_UINT32_(1) << 9) /**< ISC signal: ISC_D2 */
#define PIN_PB29F_ISC_D3                           _UINT32_(61) /**< ISC signal: ISC_D3 on PB29 mux F */
#define MUX_PB29F_ISC_D3                           _UINT32_(5)  /**< ISC signal line function value: ISC_D3 */
#define PIO_PB29F_ISC_D3                           (_UINT32_(1) << 29) /**< ISC signal: ISC_D3 */
#define PIN_PC12C_ISC_D3                           _UINT32_(76) /**< ISC signal: ISC_D3 on PC12 mux C */
#define MUX_PC12C_ISC_D3                           _UINT32_(2)  /**< ISC signal line function value: ISC_D3 */
#define PIO_PC12C_ISC_D3                           (_UINT32_(1) << 12) /**< ISC signal: ISC_D3 */
#define PIN_PD10E_ISC_D3                           _UINT32_(106) /**< ISC signal: ISC_D3 on PD10 mux E */
#define MUX_PD10E_ISC_D3                           _UINT32_(4)  /**< ISC signal line function value: ISC_D3 */
#define PIO_PD10E_ISC_D3                           (_UINT32_(1) << 10) /**< ISC signal: ISC_D3 */
#define PIN_PB30F_ISC_D4                           _UINT32_(62) /**< ISC signal: ISC_D4 on PB30 mux F */
#define MUX_PB30F_ISC_D4                           _UINT32_(5)  /**< ISC signal line function value: ISC_D4 */
#define PIO_PB30F_ISC_D4                           (_UINT32_(1) << 30) /**< ISC signal: ISC_D4 */
#define PIN_PC13C_ISC_D4                           _UINT32_(77) /**< ISC signal: ISC_D4 on PC13 mux C */
#define MUX_PC13C_ISC_D4                           _UINT32_(2)  /**< ISC signal line function value: ISC_D4 */
#define PIO_PC13C_ISC_D4                           (_UINT32_(1) << 13) /**< ISC signal: ISC_D4 */
#define PIN_PD11E_ISC_D4                           _UINT32_(107) /**< ISC signal: ISC_D4 on PD11 mux E */
#define MUX_PD11E_ISC_D4                           _UINT32_(4)  /**< ISC signal line function value: ISC_D4 */
#define PIO_PD11E_ISC_D4                           (_UINT32_(1) << 11) /**< ISC signal: ISC_D4 */
#define PIN_PD12F_ISC_D4                           _UINT32_(108) /**< ISC signal: ISC_D4 on PD12 mux F */
#define MUX_PD12F_ISC_D4                           _UINT32_(5)  /**< ISC signal line function value: ISC_D4 */
#define PIO_PD12F_ISC_D4                           (_UINT32_(1) << 12) /**< ISC signal: ISC_D4 */
#define PIN_PB31F_ISC_D5                           _UINT32_(63) /**< ISC signal: ISC_D5 on PB31 mux F */
#define MUX_PB31F_ISC_D5                           _UINT32_(5)  /**< ISC signal line function value: ISC_D5 */
#define PIO_PB31F_ISC_D5                           (_UINT32_(1) << 31) /**< ISC signal: ISC_D5 */
#define PIN_PC14C_ISC_D5                           _UINT32_(78) /**< ISC signal: ISC_D5 on PC14 mux C */
#define MUX_PC14C_ISC_D5                           _UINT32_(2)  /**< ISC signal line function value: ISC_D5 */
#define PIO_PC14C_ISC_D5                           (_UINT32_(1) << 14) /**< ISC signal: ISC_D5 */
#define PIN_PD12E_ISC_D5                           _UINT32_(108) /**< ISC signal: ISC_D5 on PD12 mux E */
#define MUX_PD12E_ISC_D5                           _UINT32_(4)  /**< ISC signal line function value: ISC_D5 */
#define PIO_PD12E_ISC_D5                           (_UINT32_(1) << 12) /**< ISC signal: ISC_D5 */
#define PIN_PD13F_ISC_D5                           _UINT32_(109) /**< ISC signal: ISC_D5 on PD13 mux F */
#define MUX_PD13F_ISC_D5                           _UINT32_(5)  /**< ISC signal line function value: ISC_D5 */
#define PIO_PD13F_ISC_D5                           (_UINT32_(1) << 13) /**< ISC signal: ISC_D5 */
#define PIN_PC0F_ISC_D6                            _UINT32_(64) /**< ISC signal: ISC_D6 on PC0 mux F */
#define MUX_PC0F_ISC_D6                            _UINT32_(5)  /**< ISC signal line function value: ISC_D6 */
#define PIO_PC0F_ISC_D6                            (_UINT32_(1) << 0) /**< ISC signal: ISC_D6 */
#define PIN_PC15C_ISC_D6                           _UINT32_(79) /**< ISC signal: ISC_D6 on PC15 mux C */
#define MUX_PC15C_ISC_D6                           _UINT32_(2)  /**< ISC signal line function value: ISC_D6 */
#define PIO_PC15C_ISC_D6                           (_UINT32_(1) << 15) /**< ISC signal: ISC_D6 */
#define PIN_PD13E_ISC_D6                           _UINT32_(109) /**< ISC signal: ISC_D6 on PD13 mux E */
#define MUX_PD13E_ISC_D6                           _UINT32_(4)  /**< ISC signal line function value: ISC_D6 */
#define PIO_PD13E_ISC_D6                           (_UINT32_(1) << 13) /**< ISC signal: ISC_D6 */
#define PIN_PD14F_ISC_D6                           _UINT32_(110) /**< ISC signal: ISC_D6 on PD14 mux F */
#define MUX_PD14F_ISC_D6                           _UINT32_(5)  /**< ISC signal line function value: ISC_D6 */
#define PIO_PD14F_ISC_D6                           (_UINT32_(1) << 14) /**< ISC signal: ISC_D6 */
#define PIN_PC1F_ISC_D7                            _UINT32_(65) /**< ISC signal: ISC_D7 on PC1 mux F */
#define MUX_PC1F_ISC_D7                            _UINT32_(5)  /**< ISC signal line function value: ISC_D7 */
#define PIO_PC1F_ISC_D7                            (_UINT32_(1) << 1) /**< ISC signal: ISC_D7 */
#define PIN_PC16C_ISC_D7                           _UINT32_(80) /**< ISC signal: ISC_D7 on PC16 mux C */
#define MUX_PC16C_ISC_D7                           _UINT32_(2)  /**< ISC signal line function value: ISC_D7 */
#define PIO_PC16C_ISC_D7                           (_UINT32_(1) << 16) /**< ISC signal: ISC_D7 */
#define PIN_PD14E_ISC_D7                           _UINT32_(110) /**< ISC signal: ISC_D7 on PD14 mux E */
#define MUX_PD14E_ISC_D7                           _UINT32_(4)  /**< ISC signal line function value: ISC_D7 */
#define PIO_PD14E_ISC_D7                           (_UINT32_(1) << 14) /**< ISC signal: ISC_D7 */
#define PIN_PD15F_ISC_D7                           _UINT32_(111) /**< ISC signal: ISC_D7 on PD15 mux F */
#define MUX_PD15F_ISC_D7                           _UINT32_(5)  /**< ISC signal line function value: ISC_D7 */
#define PIO_PD15F_ISC_D7                           (_UINT32_(1) << 15) /**< ISC signal: ISC_D7 */
#define PIN_PC2F_ISC_D8                            _UINT32_(66) /**< ISC signal: ISC_D8 on PC2 mux F */
#define MUX_PC2F_ISC_D8                            _UINT32_(5)  /**< ISC signal line function value: ISC_D8 */
#define PIO_PC2F_ISC_D8                            (_UINT32_(1) << 2) /**< ISC signal: ISC_D8 */
#define PIN_PC17C_ISC_D8                           _UINT32_(81) /**< ISC signal: ISC_D8 on PC17 mux C */
#define MUX_PC17C_ISC_D8                           _UINT32_(2)  /**< ISC signal line function value: ISC_D8 */
#define PIO_PC17C_ISC_D8                           (_UINT32_(1) << 17) /**< ISC signal: ISC_D8 */
#define PIN_PD6E_ISC_D8                            _UINT32_(102) /**< ISC signal: ISC_D8 on PD6 mux E */
#define MUX_PD6E_ISC_D8                            _UINT32_(4)  /**< ISC signal line function value: ISC_D8 */
#define PIO_PD6E_ISC_D8                            (_UINT32_(1) << 6) /**< ISC signal: ISC_D8 */
#define PIN_PD16F_ISC_D8                           _UINT32_(112) /**< ISC signal: ISC_D8 on PD16 mux F */
#define MUX_PD16F_ISC_D8                           _UINT32_(5)  /**< ISC signal line function value: ISC_D8 */
#define PIO_PD16F_ISC_D8                           (_UINT32_(1) << 16) /**< ISC signal: ISC_D8 */
#define PIN_PC3F_ISC_D9                            _UINT32_(67) /**< ISC signal: ISC_D9 on PC3 mux F */
#define MUX_PC3F_ISC_D9                            _UINT32_(5)  /**< ISC signal line function value: ISC_D9 */
#define PIO_PC3F_ISC_D9                            (_UINT32_(1) << 3) /**< ISC signal: ISC_D9 */
#define PIN_PC18C_ISC_D9                           _UINT32_(82) /**< ISC signal: ISC_D9 on PC18 mux C */
#define MUX_PC18C_ISC_D9                           _UINT32_(2)  /**< ISC signal line function value: ISC_D9 */
#define PIO_PC18C_ISC_D9                           (_UINT32_(1) << 18) /**< ISC signal: ISC_D9 */
#define PIN_PD5E_ISC_D9                            _UINT32_(101) /**< ISC signal: ISC_D9 on PD5 mux E */
#define MUX_PD5E_ISC_D9                            _UINT32_(4)  /**< ISC signal line function value: ISC_D9 */
#define PIO_PD5E_ISC_D9                            (_UINT32_(1) << 5) /**< ISC signal: ISC_D9 */
#define PIN_PD17F_ISC_D9                           _UINT32_(113) /**< ISC signal: ISC_D9 on PD17 mux F */
#define MUX_PD17F_ISC_D9                           _UINT32_(5)  /**< ISC signal line function value: ISC_D9 */
#define PIO_PD17F_ISC_D9                           (_UINT32_(1) << 17) /**< ISC signal: ISC_D9 */
#define PIN_PB24F_ISC_D10                          _UINT32_(56) /**< ISC signal: ISC_D10 on PB24 mux F */
#define MUX_PB24F_ISC_D10                          _UINT32_(5)  /**< ISC signal line function value: ISC_D10 */
#define PIO_PB24F_ISC_D10                          (_UINT32_(1) << 24) /**< ISC signal: ISC_D10 */
#define PIN_PC19C_ISC_D10                          _UINT32_(83) /**< ISC signal: ISC_D10 on PC19 mux C */
#define MUX_PC19C_ISC_D10                          _UINT32_(2)  /**< ISC signal line function value: ISC_D10 */
#define PIO_PC19C_ISC_D10                          (_UINT32_(1) << 19) /**< ISC signal: ISC_D10 */
#define PIN_PD4E_ISC_D10                           _UINT32_(100) /**< ISC signal: ISC_D10 on PD4 mux E */
#define MUX_PD4E_ISC_D10                           _UINT32_(4)  /**< ISC signal line function value: ISC_D10 */
#define PIO_PD4E_ISC_D10                           (_UINT32_(1) << 4) /**< ISC signal: ISC_D10 */
#define PIN_PD18F_ISC_D10                          _UINT32_(114) /**< ISC signal: ISC_D10 on PD18 mux F */
#define MUX_PD18F_ISC_D10                          _UINT32_(5)  /**< ISC signal line function value: ISC_D10 */
#define PIO_PD18F_ISC_D10                          (_UINT32_(1) << 18) /**< ISC signal: ISC_D10 */
#define PIN_PB25F_ISC_D11                          _UINT32_(57) /**< ISC signal: ISC_D11 on PB25 mux F */
#define MUX_PB25F_ISC_D11                          _UINT32_(5)  /**< ISC signal line function value: ISC_D11 */
#define PIO_PB25F_ISC_D11                          (_UINT32_(1) << 25) /**< ISC signal: ISC_D11 */
#define PIN_PC20C_ISC_D11                          _UINT32_(84) /**< ISC signal: ISC_D11 on PC20 mux C */
#define MUX_PC20C_ISC_D11                          _UINT32_(2)  /**< ISC signal line function value: ISC_D11 */
#define PIO_PC20C_ISC_D11                          (_UINT32_(1) << 20) /**< ISC signal: ISC_D11 */
#define PIN_PD3E_ISC_D11                           _UINT32_(99) /**< ISC signal: ISC_D11 on PD3 mux E */
#define MUX_PD3E_ISC_D11                           _UINT32_(4)  /**< ISC signal line function value: ISC_D11 */
#define PIO_PD3E_ISC_D11                           (_UINT32_(1) << 3) /**< ISC signal: ISC_D11 */
#define PIN_PD19F_ISC_D11                          _UINT32_(115) /**< ISC signal: ISC_D11 on PD19 mux F */
#define MUX_PD19F_ISC_D11                          _UINT32_(5)  /**< ISC signal line function value: ISC_D11 */
#define PIO_PD19F_ISC_D11                          (_UINT32_(1) << 19) /**< ISC signal: ISC_D11 */
#define PIN_PC8F_ISC_FIELD                         _UINT32_(72) /**< ISC signal: ISC_FIELD on PC8 mux F */
#define MUX_PC8F_ISC_FIELD                         _UINT32_(5)  /**< ISC signal line function value: ISC_FIELD */
