Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/pio/sama5d29.h
#define PIO_PC5A_LCDC_LCDVSYNC                     (_UINT32_(1) << 5) /**< LCDC signal: LCDC_LCDVSYNC */
#define PIN_PC30A_LCDC_LCDVSYNC                    _UINT32_(94) /**< LCDC signal: LCDC_LCDVSYNC on PC30 mux A */
#define MUX_PC30A_LCDC_LCDVSYNC                    _UINT32_(0)  /**< LCDC signal line function value: LCDC_LCDVSYNC */
#define PIO_PC30A_LCDC_LCDVSYNC                    (_UINT32_(1) << 30) /**< LCDC signal: LCDC_LCDVSYNC */
/* ========== PIO definition for MCAN0 peripheral ========== */
#define PIN_PC2C_MCAN0_CANRX0                      _UINT32_(66) /**< MCAN0 signal: MCAN0_CANRX0 on PC2 mux C */
#define MUX_PC2C_MCAN0_CANRX0                      _UINT32_(2)  /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PC2C_MCAN0_CANRX0                      (_UINT32_(1) << 2) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PC11E_MCAN0_CANRX0                     _UINT32_(75) /**< MCAN0 signal: MCAN0_CANRX0 on PC11 mux E */
#define MUX_PC11E_MCAN0_CANRX0                     _UINT32_(4)  /**< MCAN0 signal line function value: MCAN0_CANRX0 */
#define PIO_PC11E_MCAN0_CANRX0                     (_UINT32_(1) << 11) /**< MCAN0 signal: MCAN0_CANRX0 */
#define PIN_PC1C_MCAN0_CANTX0                      _UINT32_(65) /**< MCAN0 signal: MCAN0_CANTX0 on PC1 mux C */
#define MUX_PC1C_MCAN0_CANTX0                      _UINT32_(2)  /**< MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PC1C_MCAN0_CANTX0                      (_UINT32_(1) << 1) /**< MCAN0 signal: MCAN0_CANTX0 */
#define PIN_PC10E_MCAN0_CANTX0                     _UINT32_(74) /**< MCAN0 signal: MCAN0_CANTX0 on PC10 mux E */
#define MUX_PC10E_MCAN0_CANTX0                     _UINT32_(4)  /**< MCAN0 signal line function value: MCAN0_CANTX0 */
#define PIO_PC10E_MCAN0_CANTX0                     (_UINT32_(1) << 10) /**< MCAN0 signal: MCAN0_CANTX0 */
/* ========== PIO definition for MCAN1 peripheral ========== */
#define PIN_PC27D_MCAN1_CANRX1                     _UINT32_(91) /**< MCAN1 signal: MCAN1_CANRX1 on PC27 mux D */
#define MUX_PC27D_MCAN1_CANRX1                     _UINT32_(3)  /**< MCAN1 signal line function value: MCAN1_CANRX1 */
#define PIO_PC27D_MCAN1_CANRX1                     (_UINT32_(1) << 27) /**< MCAN1 signal: MCAN1_CANRX1 */
#define PIN_PC26D_MCAN1_CANTX1                     _UINT32_(90) /**< MCAN1 signal: MCAN1_CANTX1 on PC26 mux D */
#define MUX_PC26D_MCAN1_CANTX1                     _UINT32_(3)  /**< MCAN1 signal line function value: MCAN1_CANTX1 */
#define PIO_PC26D_MCAN1_CANTX1                     (_UINT32_(1) << 26) /**< MCAN1 signal: MCAN1_CANTX1 */
/* ========== PIO definition for PDMIC peripheral ========== */
#define PIN_PB12D_PDMIC_CLK                        _UINT32_(44) /**< PDMIC signal: PDMIC_CLK on PB12 mux D */
#define MUX_PB12D_PDMIC_CLK                        _UINT32_(3)  /**< PDMIC signal line function value: PDMIC_CLK */
#define PIO_PB12D_PDMIC_CLK                        (_UINT32_(1) << 12) /**< PDMIC signal: PDMIC_CLK */
#define PIN_PB27D_PDMIC_CLK                        _UINT32_(59) /**< PDMIC signal: PDMIC_CLK on PB27 mux D */
#define MUX_PB27D_PDMIC_CLK                        _UINT32_(3)  /**< PDMIC signal line function value: PDMIC_CLK */
#define PIO_PB27D_PDMIC_CLK                        (_UINT32_(1) << 27) /**< PDMIC signal: PDMIC_CLK */
#define PIN_PB11D_PDMIC_DAT                        _UINT32_(43) /**< PDMIC signal: PDMIC_DAT on PB11 mux D */
#define MUX_PB11D_PDMIC_DAT                        _UINT32_(3)  /**< PDMIC signal line function value: PDMIC_DAT */
#define PIO_PB11D_PDMIC_DAT                        (_UINT32_(1) << 11) /**< PDMIC signal: PDMIC_DAT */
#define PIN_PB26D_PDMIC_DAT                        _UINT32_(58) /**< PDMIC signal: PDMIC_DAT on PB26 mux D */
#define MUX_PB26D_PDMIC_DAT                        _UINT32_(3)  /**< PDMIC signal line function value: PDMIC_DAT */
#define PIO_PB26D_PDMIC_DAT                        (_UINT32_(1) << 26) /**< PDMIC signal: PDMIC_DAT */
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PC8D_PMC_PCK0                          _UINT32_(72) /**< PMC signal: PMC_PCK0 on PC8 mux D */
#define MUX_PC8D_PMC_PCK0                          _UINT32_(3)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PC8D_PMC_PCK0                          (_UINT32_(1) << 8) /**< PMC signal: PMC_PCK0 */
#define PIN_PD19A_PMC_PCK0                         _UINT32_(115) /**< PMC signal: PMC_PCK0 on PD19 mux A */
#define MUX_PD19A_PMC_PCK0                         _UINT32_(0)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PD19A_PMC_PCK0                         (_UINT32_(1) << 19) /**< PMC signal: PMC_PCK0 */
#define PIN_PD31E_PMC_PCK0                         _UINT32_(127) /**< PMC signal: PMC_PCK0 on PD31 mux E */
#define MUX_PD31E_PMC_PCK0                         _UINT32_(4)  /**< PMC signal line function value: PMC_PCK0 */
#define PIO_PD31E_PMC_PCK0                         (_UINT32_(1) << 31) /**< PMC signal: PMC_PCK0 */
#define PIN_PB13C_PMC_PCK1                         _UINT32_(45) /**< PMC signal: PMC_PCK1 on PB13 mux C */
#define MUX_PB13C_PMC_PCK1                         _UINT32_(2)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PB13C_PMC_PCK1                         (_UINT32_(1) << 13) /**< PMC signal: PMC_PCK1 */
#define PIN_PB20E_PMC_PCK1                         _UINT32_(52) /**< PMC signal: PMC_PCK1 on PB20 mux E */
#define MUX_PB20E_PMC_PCK1                         _UINT32_(4)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PB20E_PMC_PCK1                         (_UINT32_(1) << 20) /**< PMC signal: PMC_PCK1 */
#define PIN_PC27C_PMC_PCK1                         _UINT32_(91) /**< PMC signal: PMC_PCK1 on PC27 mux C */
#define MUX_PC27C_PMC_PCK1                         _UINT32_(2)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PC27C_PMC_PCK1                         (_UINT32_(1) << 27) /**< PMC signal: PMC_PCK1 */
#define PIN_PD6B_PMC_PCK1                          _UINT32_(102) /**< PMC signal: PMC_PCK1 on PD6 mux B */
#define MUX_PD6B_PMC_PCK1                          _UINT32_(1)  /**< PMC signal line function value: PMC_PCK1 */
#define PIO_PD6B_PMC_PCK1                          (_UINT32_(1) << 6) /**< PMC signal: PMC_PCK1 */
#define PIN_PA21B_PMC_PCK2                         _UINT32_(21) /**< PMC signal: PMC_PCK2 on PA21 mux B */
#define MUX_PA21B_PMC_PCK2                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PA21B_PMC_PCK2                         (_UINT32_(1) << 21) /**< PMC signal: PMC_PCK2 */
#define PIN_PC28C_PMC_PCK2                         _UINT32_(92) /**< PMC signal: PMC_PCK2 on PC28 mux C */
#define MUX_PC28C_PMC_PCK2                         _UINT32_(2)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PC28C_PMC_PCK2                         (_UINT32_(1) << 28) /**< PMC signal: PMC_PCK2 */
#define PIN_PD11B_PMC_PCK2                         _UINT32_(107) /**< PMC signal: PMC_PCK2 on PD11 mux B */
#define MUX_PD11B_PMC_PCK2                         _UINT32_(1)  /**< PMC signal line function value: PMC_PCK2 */
#define PIO_PD11B_PMC_PCK2                         (_UINT32_(1) << 11) /**< PMC signal: PMC_PCK2 */
/* ========== PIO definition for PTC peripheral ========== */
#define PIN_PD3X1_PTC_X0                           _UINT32_(99) /**< PTC signal: PTC_X0 on PD3 mux X1 */
#define PIO_PD3X1_PTC_X0                           (_UINT32_(1) << 3) /**< PTC signal: PTC_X0 */
#define PIN_PD4X1_PTC_X1                           _UINT32_(100) /**< PTC signal: PTC_X1 on PD4 mux X1 */
#define PIO_PD4X1_PTC_X1                           (_UINT32_(1) << 4) /**< PTC signal: PTC_X1 */
#define PIN_PD5X1_PTC_X2                           _UINT32_(101) /**< PTC signal: PTC_X2 on PD5 mux X1 */
#define PIO_PD5X1_PTC_X2                           (_UINT32_(1) << 5) /**< PTC signal: PTC_X2 */
#define PIN_PD6X1_PTC_X3                           _UINT32_(102) /**< PTC signal: PTC_X3 on PD6 mux X1 */
#define PIO_PD6X1_PTC_X3                           (_UINT32_(1) << 6) /**< PTC signal: PTC_X3 */
#define PIN_PD7X1_PTC_X4                           _UINT32_(103) /**< PTC signal: PTC_X4 on PD7 mux X1 */
#define PIO_PD7X1_PTC_X4                           (_UINT32_(1) << 7) /**< PTC signal: PTC_X4 */
#define PIN_PD8X1_PTC_X5                           _UINT32_(104) /**< PTC signal: PTC_X5 on PD8 mux X1 */
#define PIO_PD8X1_PTC_X5                           (_UINT32_(1) << 8) /**< PTC signal: PTC_X5 */
#define PIN_PD9X1_PTC_X6                           _UINT32_(105) /**< PTC signal: PTC_X6 on PD9 mux X1 */
#define PIO_PD9X1_PTC_X6                           (_UINT32_(1) << 9) /**< PTC signal: PTC_X6 */
#define PIN_PD10X1_PTC_X7                          _UINT32_(106) /**< PTC signal: PTC_X7 on PD10 mux X1 */
#define PIO_PD10X1_PTC_X7                          (_UINT32_(1) << 10) /**< PTC signal: PTC_X7 */
#define PIN_PD11X1_PTC_Y0                          _UINT32_(107) /**< PTC signal: PTC_Y0 on PD11 mux X1 */
#define PIO_PD11X1_PTC_Y0                          (_UINT32_(1) << 11) /**< PTC signal: PTC_Y0 */
#define PIN_PD12X1_PTC_Y1                          _UINT32_(108) /**< PTC signal: PTC_Y1 on PD12 mux X1 */
#define PIO_PD12X1_PTC_Y1                          (_UINT32_(1) << 12) /**< PTC signal: PTC_Y1 */
#define PIN_PD13X1_PTC_Y2                          _UINT32_(109) /**< PTC signal: PTC_Y2 on PD13 mux X1 */
#define PIO_PD13X1_PTC_Y2                          (_UINT32_(1) << 13) /**< PTC signal: PTC_Y2 */
#define PIN_PD14X1_PTC_Y3                          _UINT32_(110) /**< PTC signal: PTC_Y3 on PD14 mux X1 */
#define PIO_PD14X1_PTC_Y3                          (_UINT32_(1) << 14) /**< PTC signal: PTC_Y3 */
#define PIN_PD15X1_PTC_Y4                          _UINT32_(111) /**< PTC signal: PTC_Y4 on PD15 mux X1 */
#define PIO_PD15X1_PTC_Y4                          (_UINT32_(1) << 15) /**< PTC signal: PTC_Y4 */
#define PIN_PD16X1_PTC_Y5                          _UINT32_(112) /**< PTC signal: PTC_Y5 on PD16 mux X1 */
#define PIO_PD16X1_PTC_Y5                          (_UINT32_(1) << 16) /**< PTC signal: PTC_Y5 */
#define PIN_PD17X1_PTC_Y6                          _UINT32_(113) /**< PTC signal: PTC_Y6 on PD17 mux X1 */
#define PIO_PD17X1_PTC_Y6                          (_UINT32_(1) << 17) /**< PTC signal: PTC_Y6 */
#define PIN_PD18X1_PTC_Y7                          _UINT32_(114) /**< PTC signal: PTC_Y7 on PD18 mux X1 */
#define PIO_PD18X1_PTC_Y7                          (_UINT32_(1) << 18) /**< PTC signal: PTC_Y7 */
/* ========== PIO definition for PWM peripheral ========== */
#define PIN_PB3D_PWM_PWMEXTRG1                     _UINT32_(35) /**< PWM signal: PWM_PWMEXTRG1 on PB3 mux D */
#define MUX_PB3D_PWM_PWMEXTRG1                     _UINT32_(3)  /**< PWM signal line function value: PWM_PWMEXTRG1 */
#define PIO_PB3D_PWM_PWMEXTRG1                     (_UINT32_(1) << 3) /**< PWM signal: PWM_PWMEXTRG1 */
#define PIN_PB10C_PWM_PWMEXTRG2                    _UINT32_(42) /**< PWM signal: PWM_PWMEXTRG2 on PB10 mux C */
#define MUX_PB10C_PWM_PWMEXTRG2                    _UINT32_(2)  /**< PWM signal line function value: PWM_PWMEXTRG2 */
#define PIO_PB10C_PWM_PWMEXTRG2                    (_UINT32_(1) << 10) /**< PWM signal: PWM_PWMEXTRG2 */
#define PIN_PB2D_PWM_PWMFI0                        _UINT32_(34) /**< PWM signal: PWM_PWMFI0 on PB2 mux D */
#define MUX_PB2D_PWM_PWMFI0                        _UINT32_(3)  /**< PWM signal line function value: PWM_PWMFI0 */
#define PIO_PB2D_PWM_PWMFI0                        (_UINT32_(1) << 2) /**< PWM signal: PWM_PWMFI0 */
#define PIN_PB9C_PWM_PWMFI1                        _UINT32_(41) /**< PWM signal: PWM_PWMFI1 on PB9 mux C */
#define MUX_PB9C_PWM_PWMFI1                        _UINT32_(2)  /**< PWM signal line function value: PWM_PWMFI1 */
#define PIO_PB9C_PWM_PWMFI1                        (_UINT32_(1) << 9) /**< PWM signal: PWM_PWMFI1 */
#define PIN_PA30D_PWM_PWMH0                        _UINT32_(30) /**< PWM signal: PWM_PWMH0 on PA30 mux D */
#define MUX_PA30D_PWM_PWMH0                        _UINT32_(3)  /**< PWM signal line function value: PWM_PWMH0 */
#define PIO_PA30D_PWM_PWMH0                        (_UINT32_(1) << 30) /**< PWM signal: PWM_PWMH0 */
#define PIN_PB0D_PWM_PWMH1                         _UINT32_(32) /**< PWM signal: PWM_PWMH1 on PB0 mux D */
#define MUX_PB0D_PWM_PWMH1                         _UINT32_(3)  /**< PWM signal line function value: PWM_PWMH1 */
#define PIO_PB0D_PWM_PWMH1                         (_UINT32_(1) << 0) /**< PWM signal: PWM_PWMH1 */
#define PIN_PB5C_PWM_PWMH2                         _UINT32_(37) /**< PWM signal: PWM_PWMH2 on PB5 mux C */
#define MUX_PB5C_PWM_PWMH2                         _UINT32_(2)  /**< PWM signal line function value: PWM_PWMH2 */
#define PIO_PB5C_PWM_PWMH2                         (_UINT32_(1) << 5) /**< PWM signal: PWM_PWMH2 */
#define PIN_PB7C_PWM_PWMH3                         _UINT32_(39) /**< PWM signal: PWM_PWMH3 on PB7 mux C */
#define MUX_PB7C_PWM_PWMH3                         _UINT32_(2)  /**< PWM signal line function value: PWM_PWMH3 */
#define PIO_PB7C_PWM_PWMH3                         (_UINT32_(1) << 7) /**< PWM signal: PWM_PWMH3 */
#define PIN_PA31D_PWM_PWML0                        _UINT32_(31) /**< PWM signal: PWM_PWML0 on PA31 mux D */
#define MUX_PA31D_PWM_PWML0                        _UINT32_(3)  /**< PWM signal line function value: PWM_PWML0 */
#define PIO_PA31D_PWM_PWML0                        (_UINT32_(1) << 31) /**< PWM signal: PWM_PWML0 */
#define PIN_PB1D_PWM_PWML1                         _UINT32_(33) /**< PWM signal: PWM_PWML1 on PB1 mux D */
#define MUX_PB1D_PWM_PWML1                         _UINT32_(3)  /**< PWM signal line function value: PWM_PWML1 */
#define PIO_PB1D_PWM_PWML1                         (_UINT32_(1) << 1) /**< PWM signal: PWM_PWML1 */
#define PIN_PB6C_PWM_PWML2                         _UINT32_(38) /**< PWM signal: PWM_PWML2 on PB6 mux C */
#define MUX_PB6C_PWM_PWML2                         _UINT32_(2)  /**< PWM signal line function value: PWM_PWML2 */
#define PIO_PB6C_PWM_PWML2                         (_UINT32_(1) << 6) /**< PWM signal: PWM_PWML2 */
#define PIN_PB8C_PWM_PWML3                         _UINT32_(40) /**< PWM signal: PWM_PWML3 on PB8 mux C */
#define MUX_PB8C_PWM_PWML3                         _UINT32_(2)  /**< PWM signal line function value: PWM_PWML3 */
#define PIO_PB8C_PWM_PWML3                         (_UINT32_(1) << 8) /**< PWM signal: PWM_PWML3 */
/* ========== PIO definition for QSPI0 peripheral ========== */
#define PIN_PA1B_QSPI0_CS                          _UINT32_(1)  /**< QSPI0 signal: QSPI0_CS on PA1 mux B */
#define MUX_PA1B_QSPI0_CS                          _UINT32_(1)  /**< QSPI0 signal line function value: QSPI0_CS */
#define PIO_PA1B_QSPI0_CS                          (_UINT32_(1) << 1) /**< QSPI0 signal: QSPI0_CS */
#define PIN_PA15C_QSPI0_CS                         _UINT32_(15) /**< QSPI0 signal: QSPI0_CS on PA15 mux C */
#define MUX_PA15C_QSPI0_CS                         _UINT32_(2)  /**< QSPI0 signal line function value: QSPI0_CS */
#define PIO_PA15C_QSPI0_CS                         (_UINT32_(1) << 15) /**< QSPI0 signal: QSPI0_CS */
#define PIN_PA23F_QSPI0_CS                         _UINT32_(23) /**< QSPI0 signal: QSPI0_CS on PA23 mux F */
#define MUX_PA23F_QSPI0_CS                         _UINT32_(5)  /**< QSPI0 signal line function value: QSPI0_CS */
#define PIO_PA23F_QSPI0_CS                         (_UINT32_(1) << 23) /**< QSPI0 signal: QSPI0_CS */
#define PIN_PA2B_QSPI0_IO0                         _UINT32_(2)  /**< QSPI0 signal: QSPI0_IO0 on PA2 mux B */
#define MUX_PA2B_QSPI0_IO0                         _UINT32_(1)  /**< QSPI0 signal line function value: QSPI0_IO0 */
#define PIO_PA2B_QSPI0_IO0                         (_UINT32_(1) << 2) /**< QSPI0 signal: QSPI0_IO0 */
#define PIN_PA16C_QSPI0_IO0                        _UINT32_(16) /**< QSPI0 signal: QSPI0_IO0 on PA16 mux C */
#define MUX_PA16C_QSPI0_IO0                        _UINT32_(2)  /**< QSPI0 signal line function value: QSPI0_IO0 */
#define PIO_PA16C_QSPI0_IO0                        (_UINT32_(1) << 16) /**< QSPI0 signal: QSPI0_IO0 */
#define PIN_PA24F_QSPI0_IO0                        _UINT32_(24) /**< QSPI0 signal: QSPI0_IO0 on PA24 mux F */
#define MUX_PA24F_QSPI0_IO0                        _UINT32_(5)  /**< QSPI0 signal line function value: QSPI0_IO0 */
#define PIO_PA24F_QSPI0_IO0                        (_UINT32_(1) << 24) /**< QSPI0 signal: QSPI0_IO0 */
#define PIN_PA3B_QSPI0_IO1                         _UINT32_(3)  /**< QSPI0 signal: QSPI0_IO1 on PA3 mux B */
#define MUX_PA3B_QSPI0_IO1                         _UINT32_(1)  /**< QSPI0 signal line function value: QSPI0_IO1 */
#define PIO_PA3B_QSPI0_IO1                         (_UINT32_(1) << 3) /**< QSPI0 signal: QSPI0_IO1 */
#define PIN_PA17C_QSPI0_IO1                        _UINT32_(17) /**< QSPI0 signal: QSPI0_IO1 on PA17 mux C */
#define MUX_PA17C_QSPI0_IO1                        _UINT32_(2)  /**< QSPI0 signal line function value: QSPI0_IO1 */
#define PIO_PA17C_QSPI0_IO1                        (_UINT32_(1) << 17) /**< QSPI0 signal: QSPI0_IO1 */
#define PIN_PA25F_QSPI0_IO1                        _UINT32_(25) /**< QSPI0 signal: QSPI0_IO1 on PA25 mux F */
#define MUX_PA25F_QSPI0_IO1                        _UINT32_(5)  /**< QSPI0 signal line function value: QSPI0_IO1 */
#define PIO_PA25F_QSPI0_IO1                        (_UINT32_(1) << 25) /**< QSPI0 signal: QSPI0_IO1 */
#define PIN_PA4B_QSPI0_IO2                         _UINT32_(4)  /**< QSPI0 signal: QSPI0_IO2 on PA4 mux B */
#define MUX_PA4B_QSPI0_IO2                         _UINT32_(1)  /**< QSPI0 signal line function value: QSPI0_IO2 */
#define PIO_PA4B_QSPI0_IO2                         (_UINT32_(1) << 4) /**< QSPI0 signal: QSPI0_IO2 */
#define PIN_PA18C_QSPI0_IO2                        _UINT32_(18) /**< QSPI0 signal: QSPI0_IO2 on PA18 mux C */
#define MUX_PA18C_QSPI0_IO2                        _UINT32_(2)  /**< QSPI0 signal line function value: QSPI0_IO2 */
#define PIO_PA18C_QSPI0_IO2                        (_UINT32_(1) << 18) /**< QSPI0 signal: QSPI0_IO2 */
#define PIN_PA26F_QSPI0_IO2                        _UINT32_(26) /**< QSPI0 signal: QSPI0_IO2 on PA26 mux F */
#define MUX_PA26F_QSPI0_IO2                        _UINT32_(5)  /**< QSPI0 signal line function value: QSPI0_IO2 */
#define PIO_PA26F_QSPI0_IO2                        (_UINT32_(1) << 26) /**< QSPI0 signal: QSPI0_IO2 */
#define PIN_PA5B_QSPI0_IO3                         _UINT32_(5)  /**< QSPI0 signal: QSPI0_IO3 on PA5 mux B */
#define MUX_PA5B_QSPI0_IO3                         _UINT32_(1)  /**< QSPI0 signal line function value: QSPI0_IO3 */
#define PIO_PA5B_QSPI0_IO3                         (_UINT32_(1) << 5) /**< QSPI0 signal: QSPI0_IO3 */
#define PIN_PA19C_QSPI0_IO3                        _UINT32_(19) /**< QSPI0 signal: QSPI0_IO3 on PA19 mux C */
#define MUX_PA19C_QSPI0_IO3                        _UINT32_(2)  /**< QSPI0 signal line function value: QSPI0_IO3 */
#define PIO_PA19C_QSPI0_IO3                        (_UINT32_(1) << 19) /**< QSPI0 signal: QSPI0_IO3 */
#define PIN_PA27F_QSPI0_IO3                        _UINT32_(27) /**< QSPI0 signal: QSPI0_IO3 on PA27 mux F */
#define MUX_PA27F_QSPI0_IO3                        _UINT32_(5)  /**< QSPI0 signal line function value: QSPI0_IO3 */
#define PIO_PA27F_QSPI0_IO3                        (_UINT32_(1) << 27) /**< QSPI0 signal: QSPI0_IO3 */
#define PIN_PA0B_QSPI0_SCK                         _UINT32_(0)  /**< QSPI0 signal: QSPI0_SCK on PA0 mux B */
#define MUX_PA0B_QSPI0_SCK                         _UINT32_(1)  /**< QSPI0 signal line function value: QSPI0_SCK */
#define PIO_PA0B_QSPI0_SCK                         (_UINT32_(1) << 0) /**< QSPI0 signal: QSPI0_SCK */
#define PIN_PA14C_QSPI0_SCK                        _UINT32_(14) /**< QSPI0 signal: QSPI0_SCK on PA14 mux C */
#define MUX_PA14C_QSPI0_SCK                        _UINT32_(2)  /**< QSPI0 signal line function value: QSPI0_SCK */
#define PIO_PA14C_QSPI0_SCK                        (_UINT32_(1) << 14) /**< QSPI0 signal: QSPI0_SCK */
#define PIN_PA22F_QSPI0_SCK                        _UINT32_(22) /**< QSPI0 signal: QSPI0_SCK on PA22 mux F */
#define MUX_PA22F_QSPI0_SCK                        _UINT32_(5)  /**< QSPI0 signal line function value: QSPI0_SCK */
#define PIO_PA22F_QSPI0_SCK                        (_UINT32_(1) << 22) /**< QSPI0 signal: QSPI0_SCK */
/* ========== PIO definition for QSPI1 peripheral ========== */
#define PIN_PA11B_QSPI1_CS                         _UINT32_(11) /**< QSPI1 signal: QSPI1_CS on PA11 mux B */
#define MUX_PA11B_QSPI1_CS                         _UINT32_(1)  /**< QSPI1 signal line function value: QSPI1_CS */
#define PIO_PA11B_QSPI1_CS                         (_UINT32_(1) << 11) /**< QSPI1 signal: QSPI1_CS */
#define PIN_PB6D_QSPI1_CS                          _UINT32_(38) /**< QSPI1 signal: QSPI1_CS on PB6 mux D */
#define MUX_PB6D_QSPI1_CS                          _UINT32_(3)  /**< QSPI1 signal line function value: QSPI1_CS */
#define PIO_PB6D_QSPI1_CS                          (_UINT32_(1) << 6) /**< QSPI1 signal: QSPI1_CS */
#define PIN_PB15E_QSPI1_CS                         _UINT32_(47) /**< QSPI1 signal: QSPI1_CS on PB15 mux E */
#define MUX_PB15E_QSPI1_CS                         _UINT32_(4)  /**< QSPI1 signal line function value: QSPI1_CS */
#define PIO_PB15E_QSPI1_CS                         (_UINT32_(1) << 15) /**< QSPI1 signal: QSPI1_CS */
#define PIN_PA7B_QSPI1_IO0                         _UINT32_(7)  /**< QSPI1 signal: QSPI1_IO0 on PA7 mux B */
#define MUX_PA7B_QSPI1_IO0                         _UINT32_(1)  /**< QSPI1 signal line function value: QSPI1_IO0 */
#define PIO_PA7B_QSPI1_IO0                         (_UINT32_(1) << 7) /**< QSPI1 signal: QSPI1_IO0 */
#define PIN_PB7D_QSPI1_IO0                         _UINT32_(39) /**< QSPI1 signal: QSPI1_IO0 on PB7 mux D */
#define MUX_PB7D_QSPI1_IO0                         _UINT32_(3)  /**< QSPI1 signal line function value: QSPI1_IO0 */
#define PIO_PB7D_QSPI1_IO0                         (_UINT32_(1) << 7) /**< QSPI1 signal: QSPI1_IO0 */
#define PIN_PB16E_QSPI1_IO0                        _UINT32_(48) /**< QSPI1 signal: QSPI1_IO0 on PB16 mux E */
#define MUX_PB16E_QSPI1_IO0                        _UINT32_(4)  /**< QSPI1 signal line function value: QSPI1_IO0 */
#define PIO_PB16E_QSPI1_IO0                        (_UINT32_(1) << 16) /**< QSPI1 signal: QSPI1_IO0 */
#define PIN_PA8B_QSPI1_IO1                         _UINT32_(8)  /**< QSPI1 signal: QSPI1_IO1 on PA8 mux B */
#define MUX_PA8B_QSPI1_IO1                         _UINT32_(1)  /**< QSPI1 signal line function value: QSPI1_IO1 */
#define PIO_PA8B_QSPI1_IO1                         (_UINT32_(1) << 8) /**< QSPI1 signal: QSPI1_IO1 */
#define PIN_PB8D_QSPI1_IO1                         _UINT32_(40) /**< QSPI1 signal: QSPI1_IO1 on PB8 mux D */
#define MUX_PB8D_QSPI1_IO1                         _UINT32_(3)  /**< QSPI1 signal line function value: QSPI1_IO1 */
#define PIO_PB8D_QSPI1_IO1                         (_UINT32_(1) << 8) /**< QSPI1 signal: QSPI1_IO1 */
#define PIN_PB17E_QSPI1_IO1                        _UINT32_(49) /**< QSPI1 signal: QSPI1_IO1 on PB17 mux E */
#define MUX_PB17E_QSPI1_IO1                        _UINT32_(4)  /**< QSPI1 signal line function value: QSPI1_IO1 */
#define PIO_PB17E_QSPI1_IO1                        (_UINT32_(1) << 17) /**< QSPI1 signal: QSPI1_IO1 */
#define PIN_PA9B_QSPI1_IO2                         _UINT32_(9)  /**< QSPI1 signal: QSPI1_IO2 on PA9 mux B */
#define MUX_PA9B_QSPI1_IO2                         _UINT32_(1)  /**< QSPI1 signal line function value: QSPI1_IO2 */
#define PIO_PA9B_QSPI1_IO2                         (_UINT32_(1) << 9) /**< QSPI1 signal: QSPI1_IO2 */
#define PIN_PB9D_QSPI1_IO2                         _UINT32_(41) /**< QSPI1 signal: QSPI1_IO2 on PB9 mux D */
