Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/pio/sama5d29.h
#define MUX_PB9D_QSPI1_IO2                         _UINT32_(3)  /**< QSPI1 signal line function value: QSPI1_IO2 */
#define PIO_PB9D_QSPI1_IO2                         (_UINT32_(1) << 9) /**< QSPI1 signal: QSPI1_IO2 */
#define PIN_PB18E_QSPI1_IO2                        _UINT32_(50) /**< QSPI1 signal: QSPI1_IO2 on PB18 mux E */
#define MUX_PB18E_QSPI1_IO2                        _UINT32_(4)  /**< QSPI1 signal line function value: QSPI1_IO2 */
#define PIO_PB18E_QSPI1_IO2                        (_UINT32_(1) << 18) /**< QSPI1 signal: QSPI1_IO2 */
#define PIN_PA10B_QSPI1_IO3                        _UINT32_(10) /**< QSPI1 signal: QSPI1_IO3 on PA10 mux B */
#define MUX_PA10B_QSPI1_IO3                        _UINT32_(1)  /**< QSPI1 signal line function value: QSPI1_IO3 */
#define PIO_PA10B_QSPI1_IO3                        (_UINT32_(1) << 10) /**< QSPI1 signal: QSPI1_IO3 */
#define PIN_PB10D_QSPI1_IO3                        _UINT32_(42) /**< QSPI1 signal: QSPI1_IO3 on PB10 mux D */
#define MUX_PB10D_QSPI1_IO3                        _UINT32_(3)  /**< QSPI1 signal line function value: QSPI1_IO3 */
#define PIO_PB10D_QSPI1_IO3                        (_UINT32_(1) << 10) /**< QSPI1 signal: QSPI1_IO3 */
#define PIN_PB19E_QSPI1_IO3                        _UINT32_(51) /**< QSPI1 signal: QSPI1_IO3 on PB19 mux E */
#define MUX_PB19E_QSPI1_IO3                        _UINT32_(4)  /**< QSPI1 signal line function value: QSPI1_IO3 */
#define PIO_PB19E_QSPI1_IO3                        (_UINT32_(1) << 19) /**< QSPI1 signal: QSPI1_IO3 */
#define PIN_PA6B_QSPI1_SCK                         _UINT32_(6)  /**< QSPI1 signal: QSPI1_SCK on PA6 mux B */
#define MUX_PA6B_QSPI1_SCK                         _UINT32_(1)  /**< QSPI1 signal line function value: QSPI1_SCK */
#define PIO_PA6B_QSPI1_SCK                         (_UINT32_(1) << 6) /**< QSPI1 signal: QSPI1_SCK */
#define PIN_PB5D_QSPI1_SCK                         _UINT32_(37) /**< QSPI1 signal: QSPI1_SCK on PB5 mux D */
#define MUX_PB5D_QSPI1_SCK                         _UINT32_(3)  /**< QSPI1 signal line function value: QSPI1_SCK */
#define PIO_PB5D_QSPI1_SCK                         (_UINT32_(1) << 5) /**< QSPI1 signal: QSPI1_SCK */
#define PIN_PB14E_QSPI1_SCK                        _UINT32_(46) /**< QSPI1 signal: QSPI1_SCK on PB14 mux E */
#define MUX_PB14E_QSPI1_SCK                        _UINT32_(4)  /**< QSPI1 signal line function value: QSPI1_SCK */
#define PIO_PB14E_QSPI1_SCK                        (_UINT32_(1) << 14) /**< QSPI1 signal: QSPI1_SCK */
/* ========== PIO definition for SDMMC0 peripheral ========== */
#define PIN_PA11A_SDMMC0_1V8SEL                    _UINT32_(11) /**< SDMMC0 signal: SDMMC0_1V8SEL on PA11 mux A */
#define MUX_PA11A_SDMMC0_1V8SEL                    _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_1V8SEL */
#define PIO_PA11A_SDMMC0_1V8SEL                    (_UINT32_(1) << 11) /**< SDMMC0 signal: SDMMC0_1V8SEL */
#define PIN_PA13A_SDMMC0_CD                        _UINT32_(13) /**< SDMMC0 signal: SDMMC0_CD on PA13 mux A */
#define MUX_PA13A_SDMMC0_CD                        _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_CD */
#define PIO_PA13A_SDMMC0_CD                        (_UINT32_(1) << 13) /**< SDMMC0 signal: SDMMC0_CD */
#define PIN_PA0A_SDMMC0_CK                         _UINT32_(0)  /**< SDMMC0 signal: SDMMC0_CK on PA0 mux A */
#define MUX_PA0A_SDMMC0_CK                         _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_CK */
#define PIO_PA0A_SDMMC0_CK                         (_UINT32_(1) << 0) /**< SDMMC0 signal: SDMMC0_CK */
#define PIN_PA1A_SDMMC0_CMD                        _UINT32_(1)  /**< SDMMC0 signal: SDMMC0_CMD on PA1 mux A */
#define MUX_PA1A_SDMMC0_CMD                        _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_CMD */
#define PIO_PA1A_SDMMC0_CMD                        (_UINT32_(1) << 1) /**< SDMMC0 signal: SDMMC0_CMD */
#define PIN_PA2A_SDMMC0_DAT0                       _UINT32_(2)  /**< SDMMC0 signal: SDMMC0_DAT0 on PA2 mux A */
#define MUX_PA2A_SDMMC0_DAT0                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT0 */
#define PIO_PA2A_SDMMC0_DAT0                       (_UINT32_(1) << 2) /**< SDMMC0 signal: SDMMC0_DAT0 */
#define PIN_PA3A_SDMMC0_DAT1                       _UINT32_(3)  /**< SDMMC0 signal: SDMMC0_DAT1 on PA3 mux A */
#define MUX_PA3A_SDMMC0_DAT1                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT1 */
#define PIO_PA3A_SDMMC0_DAT1                       (_UINT32_(1) << 3) /**< SDMMC0 signal: SDMMC0_DAT1 */
#define PIN_PA4A_SDMMC0_DAT2                       _UINT32_(4)  /**< SDMMC0 signal: SDMMC0_DAT2 on PA4 mux A */
#define MUX_PA4A_SDMMC0_DAT2                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT2 */
#define PIO_PA4A_SDMMC0_DAT2                       (_UINT32_(1) << 4) /**< SDMMC0 signal: SDMMC0_DAT2 */
#define PIN_PA5A_SDMMC0_DAT3                       _UINT32_(5)  /**< SDMMC0 signal: SDMMC0_DAT3 on PA5 mux A */
#define MUX_PA5A_SDMMC0_DAT3                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT3 */
#define PIO_PA5A_SDMMC0_DAT3                       (_UINT32_(1) << 5) /**< SDMMC0 signal: SDMMC0_DAT3 */
#define PIN_PA6A_SDMMC0_DAT4                       _UINT32_(6)  /**< SDMMC0 signal: SDMMC0_DAT4 on PA6 mux A */
#define MUX_PA6A_SDMMC0_DAT4                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT4 */
#define PIO_PA6A_SDMMC0_DAT4                       (_UINT32_(1) << 6) /**< SDMMC0 signal: SDMMC0_DAT4 */
#define PIN_PA7A_SDMMC0_DAT5                       _UINT32_(7)  /**< SDMMC0 signal: SDMMC0_DAT5 on PA7 mux A */
#define MUX_PA7A_SDMMC0_DAT5                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT5 */
#define PIO_PA7A_SDMMC0_DAT5                       (_UINT32_(1) << 7) /**< SDMMC0 signal: SDMMC0_DAT5 */
#define PIN_PA8A_SDMMC0_DAT6                       _UINT32_(8)  /**< SDMMC0 signal: SDMMC0_DAT6 on PA8 mux A */
#define MUX_PA8A_SDMMC0_DAT6                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT6 */
#define PIO_PA8A_SDMMC0_DAT6                       (_UINT32_(1) << 8) /**< SDMMC0 signal: SDMMC0_DAT6 */
#define PIN_PA9A_SDMMC0_DAT7                       _UINT32_(9)  /**< SDMMC0 signal: SDMMC0_DAT7 on PA9 mux A */
#define MUX_PA9A_SDMMC0_DAT7                       _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_DAT7 */
#define PIO_PA9A_SDMMC0_DAT7                       (_UINT32_(1) << 9) /**< SDMMC0 signal: SDMMC0_DAT7 */
#define PIN_PA10A_SDMMC0_RSTN                      _UINT32_(10) /**< SDMMC0 signal: SDMMC0_RSTN on PA10 mux A */
#define MUX_PA10A_SDMMC0_RSTN                      _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_RSTN */
#define PIO_PA10A_SDMMC0_RSTN                      (_UINT32_(1) << 10) /**< SDMMC0 signal: SDMMC0_RSTN */
#define PIN_PA12A_SDMMC0_WP                        _UINT32_(12) /**< SDMMC0 signal: SDMMC0_WP on PA12 mux A */
#define MUX_PA12A_SDMMC0_WP                        _UINT32_(0)  /**< SDMMC0 signal line function value: SDMMC0_WP */
#define PIO_PA12A_SDMMC0_WP                        (_UINT32_(1) << 12) /**< SDMMC0 signal: SDMMC0_WP */
/* ========== PIO definition for SDMMC1 peripheral ========== */
#define PIN_PA30E_SDMMC1_CD                        _UINT32_(30) /**< SDMMC1 signal: SDMMC1_CD on PA30 mux E */
#define MUX_PA30E_SDMMC1_CD                        _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_CD */
#define PIO_PA30E_SDMMC1_CD                        (_UINT32_(1) << 30) /**< SDMMC1 signal: SDMMC1_CD */
#define PIN_PA22E_SDMMC1_CK                        _UINT32_(22) /**< SDMMC1 signal: SDMMC1_CK on PA22 mux E */
#define MUX_PA22E_SDMMC1_CK                        _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_CK */
#define PIO_PA22E_SDMMC1_CK                        (_UINT32_(1) << 22) /**< SDMMC1 signal: SDMMC1_CK */
#define PIN_PA28E_SDMMC1_CMD                       _UINT32_(28) /**< SDMMC1 signal: SDMMC1_CMD on PA28 mux E */
#define MUX_PA28E_SDMMC1_CMD                       _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_CMD */
#define PIO_PA28E_SDMMC1_CMD                       (_UINT32_(1) << 28) /**< SDMMC1 signal: SDMMC1_CMD */
#define PIN_PA18E_SDMMC1_DAT0                      _UINT32_(18) /**< SDMMC1 signal: SDMMC1_DAT0 on PA18 mux E */
#define MUX_PA18E_SDMMC1_DAT0                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_DAT0 */
#define PIO_PA18E_SDMMC1_DAT0                      (_UINT32_(1) << 18) /**< SDMMC1 signal: SDMMC1_DAT0 */
#define PIN_PA19E_SDMMC1_DAT1                      _UINT32_(19) /**< SDMMC1 signal: SDMMC1_DAT1 on PA19 mux E */
#define MUX_PA19E_SDMMC1_DAT1                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_DAT1 */
#define PIO_PA19E_SDMMC1_DAT1                      (_UINT32_(1) << 19) /**< SDMMC1 signal: SDMMC1_DAT1 */
#define PIN_PA20E_SDMMC1_DAT2                      _UINT32_(20) /**< SDMMC1 signal: SDMMC1_DAT2 on PA20 mux E */
#define MUX_PA20E_SDMMC1_DAT2                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_DAT2 */
#define PIO_PA20E_SDMMC1_DAT2                      (_UINT32_(1) << 20) /**< SDMMC1 signal: SDMMC1_DAT2 */
#define PIN_PA21E_SDMMC1_DAT3                      _UINT32_(21) /**< SDMMC1 signal: SDMMC1_DAT3 on PA21 mux E */
#define MUX_PA21E_SDMMC1_DAT3                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_DAT3 */
#define PIO_PA21E_SDMMC1_DAT3                      (_UINT32_(1) << 21) /**< SDMMC1 signal: SDMMC1_DAT3 */
#define PIN_PA27E_SDMMC1_RSTN                      _UINT32_(27) /**< SDMMC1 signal: SDMMC1_RSTN on PA27 mux E */
#define MUX_PA27E_SDMMC1_RSTN                      _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_RSTN */
#define PIO_PA27E_SDMMC1_RSTN                      (_UINT32_(1) << 27) /**< SDMMC1 signal: SDMMC1_RSTN */
#define PIN_PA29E_SDMMC1_WP                        _UINT32_(29) /**< SDMMC1 signal: SDMMC1_WP on PA29 mux E */
#define MUX_PA29E_SDMMC1_WP                        _UINT32_(4)  /**< SDMMC1 signal line function value: SDMMC1_WP */
#define PIO_PA29E_SDMMC1_WP                        (_UINT32_(1) << 29) /**< SDMMC1 signal: SDMMC1_WP */
/* ========== PIO definition for HSMC peripheral ========== */
#define PIN_PB12B_HSMC_A1                          _UINT32_(44) /**< HSMC signal: HSMC_A1 on PB12 mux B */
#define MUX_PB12B_HSMC_A1                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A1 */
#define PIO_PB12B_HSMC_A1                          (_UINT32_(1) << 12) /**< HSMC signal: HSMC_A1 */
#define PIN_PC12C_HSMC_A1                          _UINT32_(76) /**< HSMC signal: HSMC_A1 on PC12 mux C */
#define MUX_PC12C_HSMC_A1                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A1 */
#define PIO_PC12C_HSMC_A1                          (_UINT32_(1) << 12) /**< HSMC signal: HSMC_A1 */
#define PIN_PB13B_HSMC_A2                          _UINT32_(45) /**< HSMC signal: HSMC_A2 on PB13 mux B */
#define MUX_PB13B_HSMC_A2                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A2 */
#define PIO_PB13B_HSMC_A2                          (_UINT32_(1) << 13) /**< HSMC signal: HSMC_A2 */
#define PIN_PC13C_HSMC_A2                          _UINT32_(77) /**< HSMC signal: HSMC_A2 on PC13 mux C */
#define MUX_PC13C_HSMC_A2                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A2 */
#define PIO_PC13C_HSMC_A2                          (_UINT32_(1) << 13) /**< HSMC signal: HSMC_A2 */
#define PIN_PB14B_HSMC_A3                          _UINT32_(46) /**< HSMC signal: HSMC_A3 on PB14 mux B */
#define MUX_PB14B_HSMC_A3                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A3 */
#define PIO_PB14B_HSMC_A3                          (_UINT32_(1) << 14) /**< HSMC signal: HSMC_A3 */
#define PIN_PC14C_HSMC_A3                          _UINT32_(78) /**< HSMC signal: HSMC_A3 on PC14 mux C */
#define MUX_PC14C_HSMC_A3                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A3 */
#define PIO_PC14C_HSMC_A3                          (_UINT32_(1) << 14) /**< HSMC signal: HSMC_A3 */
#define PIN_PB15B_HSMC_A4                          _UINT32_(47) /**< HSMC signal: HSMC_A4 on PB15 mux B */
#define MUX_PB15B_HSMC_A4                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A4 */
#define PIO_PB15B_HSMC_A4                          (_UINT32_(1) << 15) /**< HSMC signal: HSMC_A4 */
#define PIN_PC15C_HSMC_A4                          _UINT32_(79) /**< HSMC signal: HSMC_A4 on PC15 mux C */
#define MUX_PC15C_HSMC_A4                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A4 */
#define PIO_PC15C_HSMC_A4                          (_UINT32_(1) << 15) /**< HSMC signal: HSMC_A4 */
#define PIN_PB16B_HSMC_A5                          _UINT32_(48) /**< HSMC signal: HSMC_A5 on PB16 mux B */
#define MUX_PB16B_HSMC_A5                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A5 */
#define PIO_PB16B_HSMC_A5                          (_UINT32_(1) << 16) /**< HSMC signal: HSMC_A5 */
#define PIN_PC16C_HSMC_A5                          _UINT32_(80) /**< HSMC signal: HSMC_A5 on PC16 mux C */
#define MUX_PC16C_HSMC_A5                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A5 */
#define PIO_PC16C_HSMC_A5                          (_UINT32_(1) << 16) /**< HSMC signal: HSMC_A5 */
#define PIN_PB17B_HSMC_A6                          _UINT32_(49) /**< HSMC signal: HSMC_A6 on PB17 mux B */
#define MUX_PB17B_HSMC_A6                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A6 */
#define PIO_PB17B_HSMC_A6                          (_UINT32_(1) << 17) /**< HSMC signal: HSMC_A6 */
#define PIN_PC17C_HSMC_A6                          _UINT32_(81) /**< HSMC signal: HSMC_A6 on PC17 mux C */
#define MUX_PC17C_HSMC_A6                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A6 */
#define PIO_PC17C_HSMC_A6                          (_UINT32_(1) << 17) /**< HSMC signal: HSMC_A6 */
#define PIN_PB18B_HSMC_A7                          _UINT32_(50) /**< HSMC signal: HSMC_A7 on PB18 mux B */
#define MUX_PB18B_HSMC_A7                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A7 */
#define PIO_PB18B_HSMC_A7                          (_UINT32_(1) << 18) /**< HSMC signal: HSMC_A7 */
#define PIN_PC18C_HSMC_A7                          _UINT32_(82) /**< HSMC signal: HSMC_A7 on PC18 mux C */
#define MUX_PC18C_HSMC_A7                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A7 */
#define PIO_PC18C_HSMC_A7                          (_UINT32_(1) << 18) /**< HSMC signal: HSMC_A7 */
#define PIN_PB19B_HSMC_A8                          _UINT32_(51) /**< HSMC signal: HSMC_A8 on PB19 mux B */
#define MUX_PB19B_HSMC_A8                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A8 */
#define PIO_PB19B_HSMC_A8                          (_UINT32_(1) << 19) /**< HSMC signal: HSMC_A8 */
#define PIN_PC19C_HSMC_A8                          _UINT32_(83) /**< HSMC signal: HSMC_A8 on PC19 mux C */
#define MUX_PC19C_HSMC_A8                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A8 */
#define PIO_PC19C_HSMC_A8                          (_UINT32_(1) << 19) /**< HSMC signal: HSMC_A8 */
#define PIN_PB20B_HSMC_A9                          _UINT32_(52) /**< HSMC signal: HSMC_A9 on PB20 mux B */
#define MUX_PB20B_HSMC_A9                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A9 */
#define PIO_PB20B_HSMC_A9                          (_UINT32_(1) << 20) /**< HSMC signal: HSMC_A9 */
#define PIN_PC20C_HSMC_A9                          _UINT32_(84) /**< HSMC signal: HSMC_A9 on PC20 mux C */
#define MUX_PC20C_HSMC_A9                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A9 */
#define PIO_PC20C_HSMC_A9                          (_UINT32_(1) << 20) /**< HSMC signal: HSMC_A9 */
#define PIN_PB21B_HSMC_A10                         _UINT32_(53) /**< HSMC signal: HSMC_A10 on PB21 mux B */
#define MUX_PB21B_HSMC_A10                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A10 */
#define PIO_PB21B_HSMC_A10                         (_UINT32_(1) << 21) /**< HSMC signal: HSMC_A10 */
#define PIN_PC21C_HSMC_A10                         _UINT32_(85) /**< HSMC signal: HSMC_A10 on PC21 mux C */
#define MUX_PC21C_HSMC_A10                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A10 */
#define PIO_PC21C_HSMC_A10                         (_UINT32_(1) << 21) /**< HSMC signal: HSMC_A10 */
#define PIN_PB22B_HSMC_A11                         _UINT32_(54) /**< HSMC signal: HSMC_A11 on PB22 mux B */
#define MUX_PB22B_HSMC_A11                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A11 */
#define PIO_PB22B_HSMC_A11                         (_UINT32_(1) << 22) /**< HSMC signal: HSMC_A11 */
#define PIN_PC22C_HSMC_A11                         _UINT32_(86) /**< HSMC signal: HSMC_A11 on PC22 mux C */
#define MUX_PC22C_HSMC_A11                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A11 */
#define PIO_PC22C_HSMC_A11                         (_UINT32_(1) << 22) /**< HSMC signal: HSMC_A11 */
#define PIN_PB23B_HSMC_A12                         _UINT32_(55) /**< HSMC signal: HSMC_A12 on PB23 mux B */
#define MUX_PB23B_HSMC_A12                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A12 */
#define PIO_PB23B_HSMC_A12                         (_UINT32_(1) << 23) /**< HSMC signal: HSMC_A12 */
#define PIN_PC23C_HSMC_A12                         _UINT32_(87) /**< HSMC signal: HSMC_A12 on PC23 mux C */
#define MUX_PC23C_HSMC_A12                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A12 */
#define PIO_PC23C_HSMC_A12                         (_UINT32_(1) << 23) /**< HSMC signal: HSMC_A12 */
#define PIN_PB24B_HSMC_A13                         _UINT32_(56) /**< HSMC signal: HSMC_A13 on PB24 mux B */
#define MUX_PB24B_HSMC_A13                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A13 */
#define PIO_PB24B_HSMC_A13                         (_UINT32_(1) << 24) /**< HSMC signal: HSMC_A13 */
#define PIN_PC24C_HSMC_A13                         _UINT32_(88) /**< HSMC signal: HSMC_A13 on PC24 mux C */
#define MUX_PC24C_HSMC_A13                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A13 */
#define PIO_PC24C_HSMC_A13                         (_UINT32_(1) << 24) /**< HSMC signal: HSMC_A13 */
#define PIN_PB25B_HSMC_A14                         _UINT32_(57) /**< HSMC signal: HSMC_A14 on PB25 mux B */
#define MUX_PB25B_HSMC_A14                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A14 */
#define PIO_PB25B_HSMC_A14                         (_UINT32_(1) << 25) /**< HSMC signal: HSMC_A14 */
#define PIN_PC25C_HSMC_A14                         _UINT32_(89) /**< HSMC signal: HSMC_A14 on PC25 mux C */
#define MUX_PC25C_HSMC_A14                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A14 */
#define PIO_PC25C_HSMC_A14                         (_UINT32_(1) << 25) /**< HSMC signal: HSMC_A14 */
#define PIN_PB26B_HSMC_A15                         _UINT32_(58) /**< HSMC signal: HSMC_A15 on PB26 mux B */
#define MUX_PB26B_HSMC_A15                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A15 */
#define PIO_PB26B_HSMC_A15                         (_UINT32_(1) << 26) /**< HSMC signal: HSMC_A15 */
#define PIN_PC26C_HSMC_A15                         _UINT32_(90) /**< HSMC signal: HSMC_A15 on PC26 mux C */
#define MUX_PC26C_HSMC_A15                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A15 */
#define PIO_PC26C_HSMC_A15                         (_UINT32_(1) << 26) /**< HSMC signal: HSMC_A15 */
#define PIN_PB27B_HSMC_A16                         _UINT32_(59) /**< HSMC signal: HSMC_A16 on PB27 mux B */
#define MUX_PB27B_HSMC_A16                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A16 */
#define PIO_PB27B_HSMC_A16                         (_UINT32_(1) << 27) /**< HSMC signal: HSMC_A16 */
#define PIN_PC27C_HSMC_A16                         _UINT32_(91) /**< HSMC signal: HSMC_A16 on PC27 mux C */
#define MUX_PC27C_HSMC_A16                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A16 */
#define PIO_PC27C_HSMC_A16                         (_UINT32_(1) << 27) /**< HSMC signal: HSMC_A16 */
#define PIN_PB28B_HSMC_A17                         _UINT32_(60) /**< HSMC signal: HSMC_A17 on PB28 mux B */
#define MUX_PB28B_HSMC_A17                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A17 */
#define PIO_PB28B_HSMC_A17                         (_UINT32_(1) << 28) /**< HSMC signal: HSMC_A17 */
#define PIN_PC28C_HSMC_A17                         _UINT32_(92) /**< HSMC signal: HSMC_A17 on PC28 mux C */
#define MUX_PC28C_HSMC_A17                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A17 */
#define PIO_PC28C_HSMC_A17                         (_UINT32_(1) << 28) /**< HSMC signal: HSMC_A17 */
#define PIN_PB29B_HSMC_A18                         _UINT32_(61) /**< HSMC signal: HSMC_A18 on PB29 mux B */
#define MUX_PB29B_HSMC_A18                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A18 */
#define PIO_PB29B_HSMC_A18                         (_UINT32_(1) << 29) /**< HSMC signal: HSMC_A18 */
#define PIN_PC29C_HSMC_A18                         _UINT32_(93) /**< HSMC signal: HSMC_A18 on PC29 mux C */
#define MUX_PC29C_HSMC_A18                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A18 */
#define PIO_PC29C_HSMC_A18                         (_UINT32_(1) << 29) /**< HSMC signal: HSMC_A18 */
#define PIN_PB30B_HSMC_A19                         _UINT32_(62) /**< HSMC signal: HSMC_A19 on PB30 mux B */
#define MUX_PB30B_HSMC_A19                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A19 */
#define PIO_PB30B_HSMC_A19                         (_UINT32_(1) << 30) /**< HSMC signal: HSMC_A19 */
#define PIN_PC30C_HSMC_A19                         _UINT32_(94) /**< HSMC signal: HSMC_A19 on PC30 mux C */
#define MUX_PC30C_HSMC_A19                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A19 */
#define PIO_PC30C_HSMC_A19                         (_UINT32_(1) << 30) /**< HSMC signal: HSMC_A19 */
#define PIN_PB31B_HSMC_A20                         _UINT32_(63) /**< HSMC signal: HSMC_A20 on PB31 mux B */
#define MUX_PB31B_HSMC_A20                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_A20 */
#define PIO_PB31B_HSMC_A20                         (_UINT32_(1) << 31) /**< HSMC signal: HSMC_A20 */
#define PIN_PC31C_HSMC_A20                         _UINT32_(95) /**< HSMC signal: HSMC_A20 on PC31 mux C */
#define MUX_PC31C_HSMC_A20                         _UINT32_(2)  /**< HSMC signal line function value: HSMC_A20 */
#define PIO_PC31C_HSMC_A20                         (_UINT32_(1) << 31) /**< HSMC signal: HSMC_A20 */
#define PIN_PC0B_HSMC_A23                          _UINT32_(64) /**< HSMC signal: HSMC_A23 on PC0 mux B */
#define MUX_PC0B_HSMC_A23                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A23 */
#define PIO_PC0B_HSMC_A23                          (_UINT32_(1) << 0) /**< HSMC signal: HSMC_A23 */
#define PIN_PD0C_HSMC_A23                          _UINT32_(96) /**< HSMC signal: HSMC_A23 on PD0 mux C */
#define MUX_PD0C_HSMC_A23                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A23 */
#define PIO_PD0C_HSMC_A23                          (_UINT32_(1) << 0) /**< HSMC signal: HSMC_A23 */
