Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/pio/sama5d29.h
#define PIN_PC1B_HSMC_A24                          _UINT32_(65) /**< HSMC signal: HSMC_A24 on PC1 mux B */
#define MUX_PC1B_HSMC_A24                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A24 */
#define PIO_PC1B_HSMC_A24                          (_UINT32_(1) << 1) /**< HSMC signal: HSMC_A24 */
#define PIN_PD1C_HSMC_A24                          _UINT32_(97) /**< HSMC signal: HSMC_A24 on PD1 mux C */
#define MUX_PD1C_HSMC_A24                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A24 */
#define PIO_PD1C_HSMC_A24                          (_UINT32_(1) << 1) /**< HSMC signal: HSMC_A24 */
#define PIN_PC2B_HSMC_A25                          _UINT32_(66) /**< HSMC signal: HSMC_A25 on PC2 mux B */
#define MUX_PC2B_HSMC_A25                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A25 */
#define PIO_PC2B_HSMC_A25                          (_UINT32_(1) << 2) /**< HSMC signal: HSMC_A25 */
#define PIN_PD2C_HSMC_A25                          _UINT32_(98) /**< HSMC signal: HSMC_A25 on PD2 mux C */
#define MUX_PD2C_HSMC_A25                          _UINT32_(2)  /**< HSMC signal line function value: HSMC_A25 */
#define PIO_PD2C_HSMC_A25                          (_UINT32_(1) << 2) /**< HSMC signal: HSMC_A25 */
#define PIN_PB11B_HSMC_A0                          _UINT32_(43) /**< HSMC signal: HSMC_A0 on PB11 mux B */
#define MUX_PB11B_HSMC_A0                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A0 */
#define PIO_PB11B_HSMC_A0                          (_UINT32_(1) << 11) /**< HSMC signal: HSMC_A0 */
#define PIN_PC11F_HSMC_A0                          _UINT32_(75) /**< HSMC signal: HSMC_A0 on PC11 mux F */
#define MUX_PC11F_HSMC_A0                          _UINT32_(5)  /**< HSMC signal line function value: HSMC_A0 */
#define PIO_PC11F_HSMC_A0                          (_UINT32_(1) << 11) /**< HSMC signal: HSMC_A0 */
#define PIN_PA10F_HSMC_A21                         _UINT32_(10) /**< HSMC signal: HSMC_A21 on PA10 mux F */
#define MUX_PA10F_HSMC_A21                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_A21 */
#define PIO_PA10F_HSMC_A21                         (_UINT32_(1) << 10) /**< HSMC signal: HSMC_A21 */
#define PIN_PB0B_HSMC_A21                          _UINT32_(32) /**< HSMC signal: HSMC_A21 on PB0 mux B */
#define MUX_PB0B_HSMC_A21                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A21 */
#define PIO_PB0B_HSMC_A21                          (_UINT32_(1) << 0) /**< HSMC signal: HSMC_A21 */
#define PIN_PA11F_HSMC_A22                         _UINT32_(11) /**< HSMC signal: HSMC_A22 on PA11 mux F */
#define MUX_PA11F_HSMC_A22                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_A22 */
#define PIO_PA11F_HSMC_A22                         (_UINT32_(1) << 11) /**< HSMC signal: HSMC_A22 */
#define PIN_PB1B_HSMC_A22                          _UINT32_(33) /**< HSMC signal: HSMC_A22 on PB1 mux B */
#define MUX_PB1B_HSMC_A22                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_A22 */
#define PIO_PB1B_HSMC_A22                          (_UINT32_(1) << 1) /**< HSMC signal: HSMC_A22 */
#define PIN_PA0F_HSMC_D0                           _UINT32_(0)  /**< HSMC signal: HSMC_D0 on PA0 mux F */
#define MUX_PA0F_HSMC_D0                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D0 */
#define PIO_PA0F_HSMC_D0                           (_UINT32_(1) << 0) /**< HSMC signal: HSMC_D0 */
#define PIN_PA22B_HSMC_D0                          _UINT32_(22) /**< HSMC signal: HSMC_D0 on PA22 mux B */
#define MUX_PA22B_HSMC_D0                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D0 */
#define PIO_PA22B_HSMC_D0                          (_UINT32_(1) << 22) /**< HSMC signal: HSMC_D0 */
#define PIN_PA1F_HSMC_D1                           _UINT32_(1)  /**< HSMC signal: HSMC_D1 on PA1 mux F */
#define MUX_PA1F_HSMC_D1                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D1 */
#define PIO_PA1F_HSMC_D1                           (_UINT32_(1) << 1) /**< HSMC signal: HSMC_D1 */
#define PIN_PA23B_HSMC_D1                          _UINT32_(23) /**< HSMC signal: HSMC_D1 on PA23 mux B */
#define MUX_PA23B_HSMC_D1                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D1 */
#define PIO_PA23B_HSMC_D1                          (_UINT32_(1) << 23) /**< HSMC signal: HSMC_D1 */
#define PIN_PA2F_HSMC_D2                           _UINT32_(2)  /**< HSMC signal: HSMC_D2 on PA2 mux F */
#define MUX_PA2F_HSMC_D2                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D2 */
#define PIO_PA2F_HSMC_D2                           (_UINT32_(1) << 2) /**< HSMC signal: HSMC_D2 */
#define PIN_PA24B_HSMC_D2                          _UINT32_(24) /**< HSMC signal: HSMC_D2 on PA24 mux B */
#define MUX_PA24B_HSMC_D2                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D2 */
#define PIO_PA24B_HSMC_D2                          (_UINT32_(1) << 24) /**< HSMC signal: HSMC_D2 */
#define PIN_PA3F_HSMC_D3                           _UINT32_(3)  /**< HSMC signal: HSMC_D3 on PA3 mux F */
#define MUX_PA3F_HSMC_D3                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D3 */
#define PIO_PA3F_HSMC_D3                           (_UINT32_(1) << 3) /**< HSMC signal: HSMC_D3 */
#define PIN_PA25B_HSMC_D3                          _UINT32_(25) /**< HSMC signal: HSMC_D3 on PA25 mux B */
#define MUX_PA25B_HSMC_D3                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D3 */
#define PIO_PA25B_HSMC_D3                          (_UINT32_(1) << 25) /**< HSMC signal: HSMC_D3 */
#define PIN_PA4F_HSMC_D4                           _UINT32_(4)  /**< HSMC signal: HSMC_D4 on PA4 mux F */
#define MUX_PA4F_HSMC_D4                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D4 */
#define PIO_PA4F_HSMC_D4                           (_UINT32_(1) << 4) /**< HSMC signal: HSMC_D4 */
#define PIN_PA26B_HSMC_D4                          _UINT32_(26) /**< HSMC signal: HSMC_D4 on PA26 mux B */
#define MUX_PA26B_HSMC_D4                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D4 */
#define PIO_PA26B_HSMC_D4                          (_UINT32_(1) << 26) /**< HSMC signal: HSMC_D4 */
#define PIN_PA5F_HSMC_D5                           _UINT32_(5)  /**< HSMC signal: HSMC_D5 on PA5 mux F */
#define MUX_PA5F_HSMC_D5                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D5 */
#define PIO_PA5F_HSMC_D5                           (_UINT32_(1) << 5) /**< HSMC signal: HSMC_D5 */
#define PIN_PA27B_HSMC_D5                          _UINT32_(27) /**< HSMC signal: HSMC_D5 on PA27 mux B */
#define MUX_PA27B_HSMC_D5                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D5 */
#define PIO_PA27B_HSMC_D5                          (_UINT32_(1) << 27) /**< HSMC signal: HSMC_D5 */
#define PIN_PA6F_HSMC_D6                           _UINT32_(6)  /**< HSMC signal: HSMC_D6 on PA6 mux F */
#define MUX_PA6F_HSMC_D6                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D6 */
#define PIO_PA6F_HSMC_D6                           (_UINT32_(1) << 6) /**< HSMC signal: HSMC_D6 */
#define PIN_PA28B_HSMC_D6                          _UINT32_(28) /**< HSMC signal: HSMC_D6 on PA28 mux B */
#define MUX_PA28B_HSMC_D6                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D6 */
#define PIO_PA28B_HSMC_D6                          (_UINT32_(1) << 28) /**< HSMC signal: HSMC_D6 */
#define PIN_PA7F_HSMC_D7                           _UINT32_(7)  /**< HSMC signal: HSMC_D7 on PA7 mux F */
#define MUX_PA7F_HSMC_D7                           _UINT32_(5)  /**< HSMC signal line function value: HSMC_D7 */
#define PIO_PA7F_HSMC_D7                           (_UINT32_(1) << 7) /**< HSMC signal: HSMC_D7 */
#define PIN_PA29B_HSMC_D7                          _UINT32_(29) /**< HSMC signal: HSMC_D7 on PA29 mux B */
#define MUX_PA29B_HSMC_D7                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D7 */
#define PIO_PA29B_HSMC_D7                          (_UINT32_(1) << 29) /**< HSMC signal: HSMC_D7 */
#define PIN_PA13F_HSMC_D8                          _UINT32_(13) /**< HSMC signal: HSMC_D8 on PA13 mux F */
#define MUX_PA13F_HSMC_D8                          _UINT32_(5)  /**< HSMC signal line function value: HSMC_D8 */
#define PIO_PA13F_HSMC_D8                          (_UINT32_(1) << 13) /**< HSMC signal: HSMC_D8 */
#define PIN_PB3B_HSMC_D8                           _UINT32_(35) /**< HSMC signal: HSMC_D8 on PB3 mux B */
#define MUX_PB3B_HSMC_D8                           _UINT32_(1)  /**< HSMC signal line function value: HSMC_D8 */
#define PIO_PB3B_HSMC_D8                           (_UINT32_(1) << 3) /**< HSMC signal: HSMC_D8 */
#define PIN_PA14F_HSMC_D9                          _UINT32_(14) /**< HSMC signal: HSMC_D9 on PA14 mux F */
#define MUX_PA14F_HSMC_D9                          _UINT32_(5)  /**< HSMC signal line function value: HSMC_D9 */
#define PIO_PA14F_HSMC_D9                          (_UINT32_(1) << 14) /**< HSMC signal: HSMC_D9 */
#define PIN_PB4B_HSMC_D9                           _UINT32_(36) /**< HSMC signal: HSMC_D9 on PB4 mux B */
#define MUX_PB4B_HSMC_D9                           _UINT32_(1)  /**< HSMC signal line function value: HSMC_D9 */
#define PIO_PB4B_HSMC_D9                           (_UINT32_(1) << 4) /**< HSMC signal: HSMC_D9 */
#define PIN_PA15F_HSMC_D10                         _UINT32_(15) /**< HSMC signal: HSMC_D10 on PA15 mux F */
#define MUX_PA15F_HSMC_D10                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_D10 */
#define PIO_PA15F_HSMC_D10                         (_UINT32_(1) << 15) /**< HSMC signal: HSMC_D10 */
#define PIN_PB5B_HSMC_D10                          _UINT32_(37) /**< HSMC signal: HSMC_D10 on PB5 mux B */
#define MUX_PB5B_HSMC_D10                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D10 */
#define PIO_PB5B_HSMC_D10                          (_UINT32_(1) << 5) /**< HSMC signal: HSMC_D10 */
#define PIN_PA16F_HSMC_D11                         _UINT32_(16) /**< HSMC signal: HSMC_D11 on PA16 mux F */
#define MUX_PA16F_HSMC_D11                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_D11 */
#define PIO_PA16F_HSMC_D11                         (_UINT32_(1) << 16) /**< HSMC signal: HSMC_D11 */
#define PIN_PB6B_HSMC_D11                          _UINT32_(38) /**< HSMC signal: HSMC_D11 on PB6 mux B */
#define MUX_PB6B_HSMC_D11                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D11 */
#define PIO_PB6B_HSMC_D11                          (_UINT32_(1) << 6) /**< HSMC signal: HSMC_D11 */
#define PIN_PA17F_HSMC_D12                         _UINT32_(17) /**< HSMC signal: HSMC_D12 on PA17 mux F */
#define MUX_PA17F_HSMC_D12                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_D12 */
#define PIO_PA17F_HSMC_D12                         (_UINT32_(1) << 17) /**< HSMC signal: HSMC_D12 */
#define PIN_PB7B_HSMC_D12                          _UINT32_(39) /**< HSMC signal: HSMC_D12 on PB7 mux B */
#define MUX_PB7B_HSMC_D12                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D12 */
#define PIO_PB7B_HSMC_D12                          (_UINT32_(1) << 7) /**< HSMC signal: HSMC_D12 */
#define PIN_PA18F_HSMC_D13                         _UINT32_(18) /**< HSMC signal: HSMC_D13 on PA18 mux F */
#define MUX_PA18F_HSMC_D13                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_D13 */
#define PIO_PA18F_HSMC_D13                         (_UINT32_(1) << 18) /**< HSMC signal: HSMC_D13 */
#define PIN_PB8B_HSMC_D13                          _UINT32_(40) /**< HSMC signal: HSMC_D13 on PB8 mux B */
#define MUX_PB8B_HSMC_D13                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D13 */
#define PIO_PB8B_HSMC_D13                          (_UINT32_(1) << 8) /**< HSMC signal: HSMC_D13 */
#define PIN_PA19F_HSMC_D14                         _UINT32_(19) /**< HSMC signal: HSMC_D14 on PA19 mux F */
#define MUX_PA19F_HSMC_D14                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_D14 */
#define PIO_PA19F_HSMC_D14                         (_UINT32_(1) << 19) /**< HSMC signal: HSMC_D14 */
#define PIN_PB9B_HSMC_D14                          _UINT32_(41) /**< HSMC signal: HSMC_D14 on PB9 mux B */
#define MUX_PB9B_HSMC_D14                          _UINT32_(1)  /**< HSMC signal line function value: HSMC_D14 */
#define PIO_PB9B_HSMC_D14                          (_UINT32_(1) << 9) /**< HSMC signal: HSMC_D14 */
#define PIN_PA20F_HSMC_D15                         _UINT32_(20) /**< HSMC signal: HSMC_D15 on PA20 mux F */
#define MUX_PA20F_HSMC_D15                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_D15 */
#define PIO_PA20F_HSMC_D15                         (_UINT32_(1) << 20) /**< HSMC signal: HSMC_D15 */
#define PIN_PB10B_HSMC_D15                         _UINT32_(42) /**< HSMC signal: HSMC_D15 on PB10 mux B */
#define MUX_PB10B_HSMC_D15                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_D15 */
#define PIO_PB10B_HSMC_D15                         (_UINT32_(1) << 10) /**< HSMC signal: HSMC_D15 */
#define PIN_PA8F_HSMC_NANDNWE                      _UINT32_(8)  /**< HSMC signal: HSMC_NANDNWE on PA8 mux F */
#define MUX_PA8F_HSMC_NANDNWE                      _UINT32_(5)  /**< HSMC signal line function value: HSMC_NANDNWE */
#define PIO_PA8F_HSMC_NANDNWE                      (_UINT32_(1) << 8) /**< HSMC signal: HSMC_NANDNWE */
#define PIN_PA30B_HSMC_NANDNWE                     _UINT32_(30) /**< HSMC signal: HSMC_NANDNWE on PA30 mux B */
#define MUX_PA30B_HSMC_NANDNWE                     _UINT32_(1)  /**< HSMC signal line function value: HSMC_NANDNWE */
#define PIO_PA30B_HSMC_NANDNWE                     (_UINT32_(1) << 30) /**< HSMC signal: HSMC_NANDNWE */
#define PIN_PA12F_HSMC_NANDOE                      _UINT32_(12) /**< HSMC signal: HSMC_NANDOE on PA12 mux F */
#define MUX_PA12F_HSMC_NANDOE                      _UINT32_(5)  /**< HSMC signal line function value: HSMC_NANDOE */
#define PIO_PA12F_HSMC_NANDOE                      (_UINT32_(1) << 12) /**< HSMC signal: HSMC_NANDOE */
#define PIN_PB2B_HSMC_NANDOE                       _UINT32_(34) /**< HSMC signal: HSMC_NANDOE on PB2 mux B */
#define MUX_PB2B_HSMC_NANDOE                       _UINT32_(1)  /**< HSMC signal line function value: HSMC_NANDOE */
#define PIO_PB2B_HSMC_NANDOE                       (_UINT32_(1) << 2) /**< HSMC signal: HSMC_NANDOE */
#define PIN_PA21F_HSMC_NANDRDY                     _UINT32_(21) /**< HSMC signal: HSMC_NANDRDY on PA21 mux F */
#define MUX_PA21F_HSMC_NANDRDY                     _UINT32_(5)  /**< HSMC signal line function value: HSMC_NANDRDY */
#define PIO_PA21F_HSMC_NANDRDY                     (_UINT32_(1) << 21) /**< HSMC signal: HSMC_NANDRDY */
#define PIN_PC8B_HSMC_NANDRDY                      _UINT32_(72) /**< HSMC signal: HSMC_NANDRDY on PC8 mux B */
#define MUX_PC8B_HSMC_NANDRDY                      _UINT32_(1)  /**< HSMC signal line function value: HSMC_NANDRDY */
#define PIO_PC8B_HSMC_NANDRDY                      (_UINT32_(1) << 8) /**< HSMC signal: HSMC_NANDRDY */
#define PIN_PD8F_HSMC_NANDRDY                      _UINT32_(104) /**< HSMC signal: HSMC_NANDRDY on PD8 mux F */
#define MUX_PD8F_HSMC_NANDRDY                      _UINT32_(5)  /**< HSMC signal line function value: HSMC_NANDRDY */
#define PIO_PD8F_HSMC_NANDRDY                      (_UINT32_(1) << 8) /**< HSMC signal: HSMC_NANDRDY */
#define PIN_PC5B_HSMC_NCS0                         _UINT32_(69) /**< HSMC signal: HSMC_NCS0 on PC5 mux B */
#define MUX_PC5B_HSMC_NCS0                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_NCS0 */
#define PIO_PC5B_HSMC_NCS0                         (_UINT32_(1) << 5) /**< HSMC signal: HSMC_NCS0 */
#define PIN_PD4F_HSMC_NCS0                         _UINT32_(100) /**< HSMC signal: HSMC_NCS0 on PD4 mux F */
#define MUX_PD4F_HSMC_NCS0                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_NCS0 */
#define PIO_PD4F_HSMC_NCS0                         (_UINT32_(1) << 4) /**< HSMC signal: HSMC_NCS0 */
#define PIN_PD5F_HSMC_NCS1                         _UINT32_(101) /**< HSMC signal: HSMC_NCS1 on PD5 mux F */
#define MUX_PD5F_HSMC_NCS1                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_NCS1 */
#define PIO_PD5F_HSMC_NCS1                         (_UINT32_(1) << 5) /**< HSMC signal: HSMC_NCS1 */
#define PIN_PC7B_HSMC_NCS2                         _UINT32_(71) /**< HSMC signal: HSMC_NCS2 on PC7 mux B */
#define MUX_PC7B_HSMC_NCS2                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_NCS2 */
#define PIO_PC7B_HSMC_NCS2                         (_UINT32_(1) << 7) /**< HSMC signal: HSMC_NCS2 */
#define PIN_PD6F_HSMC_NCS2                         _UINT32_(102) /**< HSMC signal: HSMC_NCS2 on PD6 mux F */
#define MUX_PD6F_HSMC_NCS2                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_NCS2 */
#define PIO_PD6F_HSMC_NCS2                         (_UINT32_(1) << 6) /**< HSMC signal: HSMC_NCS2 */
#define PIN_PA9F_HSMC_NCS3                         _UINT32_(9)  /**< HSMC signal: HSMC_NCS3 on PA9 mux F */
#define MUX_PA9F_HSMC_NCS3                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_NCS3 */
#define PIO_PA9F_HSMC_NCS3                         (_UINT32_(1) << 9) /**< HSMC signal: HSMC_NCS3 */
#define PIN_PA31B_HSMC_NCS3                        _UINT32_(31) /**< HSMC signal: HSMC_NCS3 on PA31 mux B */
#define MUX_PA31B_HSMC_NCS3                        _UINT32_(1)  /**< HSMC signal line function value: HSMC_NCS3 */
#define PIO_PA31B_HSMC_NCS3                        (_UINT32_(1) << 31) /**< HSMC signal: HSMC_NCS3 */
#define PIN_PC3B_HSMC_NWAIT                        _UINT32_(67) /**< HSMC signal: HSMC_NWAIT on PC3 mux B */
#define MUX_PC3B_HSMC_NWAIT                        _UINT32_(1)  /**< HSMC signal line function value: HSMC_NWAIT */
#define PIO_PC3B_HSMC_NWAIT                        (_UINT32_(1) << 3) /**< HSMC signal: HSMC_NWAIT */
#define PIN_PD3F_HSMC_NWAIT                        _UINT32_(99) /**< HSMC signal: HSMC_NWAIT on PD3 mux F */
#define MUX_PD3F_HSMC_NWAIT                        _UINT32_(5)  /**< HSMC signal line function value: HSMC_NWAIT */
#define PIO_PD3F_HSMC_NWAIT                        (_UINT32_(1) << 3) /**< HSMC signal: HSMC_NWAIT */
#define PIN_PC4B_HSMC_NWR1                         _UINT32_(68) /**< HSMC signal: HSMC_NWR1 on PC4 mux B */
#define MUX_PC4B_HSMC_NWR1                         _UINT32_(1)  /**< HSMC signal line function value: HSMC_NWR1 */
#define PIO_PC4B_HSMC_NWR1                         (_UINT32_(1) << 4) /**< HSMC signal: HSMC_NWR1 */
#define PIN_PD7F_HSMC_NWR1                         _UINT32_(103) /**< HSMC signal: HSMC_NWR1 on PD7 mux F */
#define MUX_PD7F_HSMC_NWR1                         _UINT32_(5)  /**< HSMC signal line function value: HSMC_NWR1 */
#define PIO_PD7F_HSMC_NWR1                         (_UINT32_(1) << 7) /**< HSMC signal: HSMC_NWR1 */
/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_PA16A_SPI0_MISO                        _UINT32_(16) /**< SPI0 signal: SPI0_MISO on PA16 mux A */
#define MUX_PA16A_SPI0_MISO                        _UINT32_(0)  /**< SPI0 signal line function value: SPI0_MISO */
#define PIO_PA16A_SPI0_MISO                        (_UINT32_(1) << 16) /**< SPI0 signal: SPI0_MISO */
#define PIN_PA31C_SPI0_MISO                        _UINT32_(31) /**< SPI0 signal: SPI0_MISO on PA31 mux C */
#define MUX_PA31C_SPI0_MISO                        _UINT32_(2)  /**< SPI0 signal line function value: SPI0_MISO */
#define PIO_PA31C_SPI0_MISO                        (_UINT32_(1) << 31) /**< SPI0 signal: SPI0_MISO */
#define PIN_PA15A_SPI0_MOSI                        _UINT32_(15) /**< SPI0 signal: SPI0_MOSI on PA15 mux A */
#define MUX_PA15A_SPI0_MOSI                        _UINT32_(0)  /**< SPI0 signal line function value: SPI0_MOSI */
#define PIO_PA15A_SPI0_MOSI                        (_UINT32_(1) << 15) /**< SPI0 signal: SPI0_MOSI */
#define PIN_PB0C_SPI0_MOSI                         _UINT32_(32) /**< SPI0 signal: SPI0_MOSI on PB0 mux C */
#define MUX_PB0C_SPI0_MOSI                         _UINT32_(2)  /**< SPI0 signal line function value: SPI0_MOSI */
#define PIO_PB0C_SPI0_MOSI                         (_UINT32_(1) << 0) /**< SPI0 signal: SPI0_MOSI */
#define PIN_PA17A_SPI0_NPCS0                       _UINT32_(17) /**< SPI0 signal: SPI0_NPCS0 on PA17 mux A */
#define MUX_PA17A_SPI0_NPCS0                       _UINT32_(0)  /**< SPI0 signal line function value: SPI0_NPCS0 */
#define PIO_PA17A_SPI0_NPCS0                       (_UINT32_(1) << 17) /**< SPI0 signal: SPI0_NPCS0 */
#define PIN_PA30C_SPI0_NPCS0                       _UINT32_(30) /**< SPI0 signal: SPI0_NPCS0 on PA30 mux C */
#define MUX_PA30C_SPI0_NPCS0                       _UINT32_(2)  /**< SPI0 signal line function value: SPI0_NPCS0 */
#define PIO_PA30C_SPI0_NPCS0                       (_UINT32_(1) << 30) /**< SPI0 signal: SPI0_NPCS0 */
#define PIN_PA18A_SPI0_NPCS1                       _UINT32_(18) /**< SPI0 signal: SPI0_NPCS1 on PA18 mux A */
#define MUX_PA18A_SPI0_NPCS1                       _UINT32_(0)  /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PA18A_SPI0_NPCS1                       (_UINT32_(1) << 18) /**< SPI0 signal: SPI0_NPCS1 */
#define PIN_PA29C_SPI0_NPCS1                       _UINT32_(29) /**< SPI0 signal: SPI0_NPCS1 on PA29 mux C */
#define MUX_PA29C_SPI0_NPCS1                       _UINT32_(2)  /**< SPI0 signal line function value: SPI0_NPCS1 */
#define PIO_PA29C_SPI0_NPCS1                       (_UINT32_(1) << 29) /**< SPI0 signal: SPI0_NPCS1 */
#define PIN_PA19A_SPI0_NPCS2                       _UINT32_(19) /**< SPI0 signal: SPI0_NPCS2 on PA19 mux A */
#define MUX_PA19A_SPI0_NPCS2                       _UINT32_(0)  /**< SPI0 signal line function value: SPI0_NPCS2 */
#define PIO_PA19A_SPI0_NPCS2                       (_UINT32_(1) << 19) /**< SPI0 signal: SPI0_NPCS2 */
#define PIN_PA27C_SPI0_NPCS2                       _UINT32_(27) /**< SPI0 signal: SPI0_NPCS2 on PA27 mux C */
#define MUX_PA27C_SPI0_NPCS2                       _UINT32_(2)  /**< SPI0 signal line function value: SPI0_NPCS2 */
#define PIO_PA27C_SPI0_NPCS2                       (_UINT32_(1) << 27) /**< SPI0 signal: SPI0_NPCS2 */
#define PIN_PA20A_SPI0_NPCS3                       _UINT32_(20) /**< SPI0 signal: SPI0_NPCS3 on PA20 mux A */
#define MUX_PA20A_SPI0_NPCS3                       _UINT32_(0)  /**< SPI0 signal line function value: SPI0_NPCS3 */
#define PIO_PA20A_SPI0_NPCS3                       (_UINT32_(1) << 20) /**< SPI0 signal: SPI0_NPCS3 */
#define PIN_PA28C_SPI0_NPCS3                       _UINT32_(28) /**< SPI0 signal: SPI0_NPCS3 on PA28 mux C */
#define MUX_PA28C_SPI0_NPCS3                       _UINT32_(2)  /**< SPI0 signal line function value: SPI0_NPCS3 */
#define PIO_PA28C_SPI0_NPCS3                       (_UINT32_(1) << 28) /**< SPI0 signal: SPI0_NPCS3 */
#define PIN_PA14A_SPI0_SPCK                        _UINT32_(14) /**< SPI0 signal: SPI0_SPCK on PA14 mux A */
#define MUX_PA14A_SPI0_SPCK                        _UINT32_(0)  /**< SPI0 signal line function value: SPI0_SPCK */
#define PIO_PA14A_SPI0_SPCK                        (_UINT32_(1) << 14) /**< SPI0 signal: SPI0_SPCK */
#define PIN_PB1C_SPI0_SPCK                         _UINT32_(33) /**< SPI0 signal: SPI0_SPCK on PB1 mux C */
#define MUX_PB1C_SPI0_SPCK                         _UINT32_(2)  /**< SPI0 signal line function value: SPI0_SPCK */
