Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/mpu_uart_bootloader/bootloader_sd_emmc/firmware/src/packs/ATSAMA5D29_DFP/pio/sama5d29.h
#define PIO_PB1C_SPI0_SPCK                         (_UINT32_(1) << 1) /**< SPI0 signal: SPI0_SPCK */
/* ========== PIO definition for SPI1 peripheral ========== */
#define PIN_PA24D_SPI1_MISO                        _UINT32_(24) /**< SPI1 signal: SPI1_MISO on PA24 mux D */
#define MUX_PA24D_SPI1_MISO                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PA24D_SPI1_MISO                        (_UINT32_(1) << 24) /**< SPI1 signal: SPI1_MISO */
#define PIN_PC3D_SPI1_MISO                         _UINT32_(67) /**< SPI1 signal: SPI1_MISO on PC3 mux D */
#define MUX_PC3D_SPI1_MISO                         _UINT32_(3)  /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PC3D_SPI1_MISO                         (_UINT32_(1) << 3) /**< SPI1 signal: SPI1_MISO */
#define PIN_PD27A_SPI1_MISO                        _UINT32_(123) /**< SPI1 signal: SPI1_MISO on PD27 mux A */
#define MUX_PD27A_SPI1_MISO                        _UINT32_(0)  /**< SPI1 signal line function value: SPI1_MISO */
#define PIO_PD27A_SPI1_MISO                        (_UINT32_(1) << 27) /**< SPI1 signal: SPI1_MISO */
#define PIN_PA23D_SPI1_MOSI                        _UINT32_(23) /**< SPI1 signal: SPI1_MOSI on PA23 mux D */
#define MUX_PA23D_SPI1_MOSI                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PA23D_SPI1_MOSI                        (_UINT32_(1) << 23) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PC2D_SPI1_MOSI                         _UINT32_(66) /**< SPI1 signal: SPI1_MOSI on PC2 mux D */
#define MUX_PC2D_SPI1_MOSI                         _UINT32_(3)  /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PC2D_SPI1_MOSI                         (_UINT32_(1) << 2) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PD26A_SPI1_MOSI                        _UINT32_(122) /**< SPI1 signal: SPI1_MOSI on PD26 mux A */
#define MUX_PD26A_SPI1_MOSI                        _UINT32_(0)  /**< SPI1 signal line function value: SPI1_MOSI */
#define PIO_PD26A_SPI1_MOSI                        (_UINT32_(1) << 26) /**< SPI1 signal: SPI1_MOSI */
#define PIN_PA25D_SPI1_NPCS0                       _UINT32_(25) /**< SPI1 signal: SPI1_NPCS0 on PA25 mux D */
#define MUX_PA25D_SPI1_NPCS0                       _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PA25D_SPI1_NPCS0                       (_UINT32_(1) << 25) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PC4D_SPI1_NPCS0                        _UINT32_(68) /**< SPI1 signal: SPI1_NPCS0 on PC4 mux D */
#define MUX_PC4D_SPI1_NPCS0                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PC4D_SPI1_NPCS0                        (_UINT32_(1) << 4) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PD28A_SPI1_NPCS0                       _UINT32_(124) /**< SPI1 signal: SPI1_NPCS0 on PD28 mux A */
#define MUX_PD28A_SPI1_NPCS0                       _UINT32_(0)  /**< SPI1 signal line function value: SPI1_NPCS0 */
#define PIO_PD28A_SPI1_NPCS0                       (_UINT32_(1) << 28) /**< SPI1 signal: SPI1_NPCS0 */
#define PIN_PA26D_SPI1_NPCS1                       _UINT32_(26) /**< SPI1 signal: SPI1_NPCS1 on PA26 mux D */
#define MUX_PA26D_SPI1_NPCS1                       _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PIO_PA26D_SPI1_NPCS1                       (_UINT32_(1) << 26) /**< SPI1 signal: SPI1_NPCS1 */
#define PIN_PC5D_SPI1_NPCS1                        _UINT32_(69) /**< SPI1 signal: SPI1_NPCS1 on PC5 mux D */
#define MUX_PC5D_SPI1_NPCS1                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PIO_PC5D_SPI1_NPCS1                        (_UINT32_(1) << 5) /**< SPI1 signal: SPI1_NPCS1 */
#define PIN_PD29A_SPI1_NPCS1                       _UINT32_(125) /**< SPI1 signal: SPI1_NPCS1 on PD29 mux A */
#define MUX_PD29A_SPI1_NPCS1                       _UINT32_(0)  /**< SPI1 signal line function value: SPI1_NPCS1 */
#define PIO_PD29A_SPI1_NPCS1                       (_UINT32_(1) << 29) /**< SPI1 signal: SPI1_NPCS1 */
#define PIN_PA27D_SPI1_NPCS2                       _UINT32_(27) /**< SPI1 signal: SPI1_NPCS2 on PA27 mux D */
#define MUX_PA27D_SPI1_NPCS2                       _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PIO_PA27D_SPI1_NPCS2                       (_UINT32_(1) << 27) /**< SPI1 signal: SPI1_NPCS2 */
#define PIN_PC6D_SPI1_NPCS2                        _UINT32_(70) /**< SPI1 signal: SPI1_NPCS2 on PC6 mux D */
#define MUX_PC6D_SPI1_NPCS2                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PIO_PC6D_SPI1_NPCS2                        (_UINT32_(1) << 6) /**< SPI1 signal: SPI1_NPCS2 */
#define PIN_PD30A_SPI1_NPCS2                       _UINT32_(126) /**< SPI1 signal: SPI1_NPCS2 on PD30 mux A */
#define MUX_PD30A_SPI1_NPCS2                       _UINT32_(0)  /**< SPI1 signal line function value: SPI1_NPCS2 */
#define PIO_PD30A_SPI1_NPCS2                       (_UINT32_(1) << 30) /**< SPI1 signal: SPI1_NPCS2 */
#define PIN_PA28D_SPI1_NPCS3                       _UINT32_(28) /**< SPI1 signal: SPI1_NPCS3 on PA28 mux D */
#define MUX_PA28D_SPI1_NPCS3                       _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS3 */
#define PIO_PA28D_SPI1_NPCS3                       (_UINT32_(1) << 28) /**< SPI1 signal: SPI1_NPCS3 */
#define PIN_PC7D_SPI1_NPCS3                        _UINT32_(71) /**< SPI1 signal: SPI1_NPCS3 on PC7 mux D */
#define MUX_PC7D_SPI1_NPCS3                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_NPCS3 */
#define PIO_PC7D_SPI1_NPCS3                        (_UINT32_(1) << 7) /**< SPI1 signal: SPI1_NPCS3 */
#define PIN_PA22D_SPI1_SPCK                        _UINT32_(22) /**< SPI1 signal: SPI1_SPCK on PA22 mux D */
#define MUX_PA22D_SPI1_SPCK                        _UINT32_(3)  /**< SPI1 signal line function value: SPI1_SPCK */
#define PIO_PA22D_SPI1_SPCK                        (_UINT32_(1) << 22) /**< SPI1 signal: SPI1_SPCK */
#define PIN_PC1D_SPI1_SPCK                         _UINT32_(65) /**< SPI1 signal: SPI1_SPCK on PC1 mux D */
#define MUX_PC1D_SPI1_SPCK                         _UINT32_(3)  /**< SPI1 signal line function value: SPI1_SPCK */
#define PIO_PC1D_SPI1_SPCK                         (_UINT32_(1) << 1) /**< SPI1 signal: SPI1_SPCK */
#define PIN_PD25A_SPI1_SPCK                        _UINT32_(121) /**< SPI1 signal: SPI1_SPCK on PD25 mux A */
#define MUX_PD25A_SPI1_SPCK                        _UINT32_(0)  /**< SPI1 signal line function value: SPI1_SPCK */
#define PIO_PD25A_SPI1_SPCK                        (_UINT32_(1) << 25) /**< SPI1 signal: SPI1_SPCK */
/* ========== PIO definition for SSC0 peripheral ========== */
#define PIN_PB23C_SSC0_RD0                         _UINT32_(55) /**< SSC0 signal: SSC0_RD0 on PB23 mux C */
#define MUX_PB23C_SSC0_RD0                         _UINT32_(2)  /**< SSC0 signal line function value: SSC0_RD0 */
#define PIO_PB23C_SSC0_RD0                         (_UINT32_(1) << 23) /**< SSC0 signal: SSC0_RD0 */
#define PIN_PC15E_SSC0_RD0                         _UINT32_(79) /**< SSC0 signal: SSC0_RD0 on PC15 mux E */
#define MUX_PC15E_SSC0_RD0                         _UINT32_(4)  /**< SSC0 signal line function value: SSC0_RD0 */
#define PIO_PC15E_SSC0_RD0                         (_UINT32_(1) << 15) /**< SSC0 signal: SSC0_RD0 */
#define PIN_PB25C_SSC0_RF0                         _UINT32_(57) /**< SSC0 signal: SSC0_RF0 on PB25 mux C */
#define MUX_PB25C_SSC0_RF0                         _UINT32_(2)  /**< SSC0 signal line function value: SSC0_RF0 */
#define PIO_PB25C_SSC0_RF0                         (_UINT32_(1) << 25) /**< SSC0 signal: SSC0_RF0 */
#define PIN_PC17E_SSC0_RF0                         _UINT32_(81) /**< SSC0 signal: SSC0_RF0 on PC17 mux E */
#define MUX_PC17E_SSC0_RF0                         _UINT32_(4)  /**< SSC0 signal line function value: SSC0_RF0 */
#define PIO_PC17E_SSC0_RF0                         (_UINT32_(1) << 17) /**< SSC0 signal: SSC0_RF0 */
#define PIN_PB24C_SSC0_RK0                         _UINT32_(56) /**< SSC0 signal: SSC0_RK0 on PB24 mux C */
#define MUX_PB24C_SSC0_RK0                         _UINT32_(2)  /**< SSC0 signal line function value: SSC0_RK0 */
#define PIO_PB24C_SSC0_RK0                         (_UINT32_(1) << 24) /**< SSC0 signal: SSC0_RK0 */
#define PIN_PC16E_SSC0_RK0                         _UINT32_(80) /**< SSC0 signal: SSC0_RK0 on PC16 mux E */
#define MUX_PC16E_SSC0_RK0                         _UINT32_(4)  /**< SSC0 signal line function value: SSC0_RK0 */
#define PIO_PC16E_SSC0_RK0                         (_UINT32_(1) << 16) /**< SSC0 signal: SSC0_RK0 */
#define PIN_PB22C_SSC0_TD0                         _UINT32_(54) /**< SSC0 signal: SSC0_TD0 on PB22 mux C */
#define MUX_PB22C_SSC0_TD0                         _UINT32_(2)  /**< SSC0 signal line function value: SSC0_TD0 */
#define PIO_PB22C_SSC0_TD0                         (_UINT32_(1) << 22) /**< SSC0 signal: SSC0_TD0 */
#define PIN_PC14E_SSC0_TD0                         _UINT32_(78) /**< SSC0 signal: SSC0_TD0 on PC14 mux E */
#define MUX_PC14E_SSC0_TD0                         _UINT32_(4)  /**< SSC0 signal line function value: SSC0_TD0 */
#define PIO_PC14E_SSC0_TD0                         (_UINT32_(1) << 14) /**< SSC0 signal: SSC0_TD0 */
#define PIN_PB21C_SSC0_TF0                         _UINT32_(53) /**< SSC0 signal: SSC0_TF0 on PB21 mux C */
#define MUX_PB21C_SSC0_TF0                         _UINT32_(2)  /**< SSC0 signal line function value: SSC0_TF0 */
#define PIO_PB21C_SSC0_TF0                         (_UINT32_(1) << 21) /**< SSC0 signal: SSC0_TF0 */
#define PIN_PC13E_SSC0_TF0                         _UINT32_(77) /**< SSC0 signal: SSC0_TF0 on PC13 mux E */
#define MUX_PC13E_SSC0_TF0                         _UINT32_(4)  /**< SSC0 signal line function value: SSC0_TF0 */
#define PIO_PC13E_SSC0_TF0                         (_UINT32_(1) << 13) /**< SSC0 signal: SSC0_TF0 */
#define PIN_PB20C_SSC0_TK0                         _UINT32_(52) /**< SSC0 signal: SSC0_TK0 on PB20 mux C */
#define MUX_PB20C_SSC0_TK0                         _UINT32_(2)  /**< SSC0 signal line function value: SSC0_TK0 */
#define PIO_PB20C_SSC0_TK0                         (_UINT32_(1) << 20) /**< SSC0 signal: SSC0_TK0 */
#define PIN_PC12E_SSC0_TK0                         _UINT32_(76) /**< SSC0 signal: SSC0_TK0 on PC12 mux E */
#define MUX_PC12E_SSC0_TK0                         _UINT32_(4)  /**< SSC0 signal line function value: SSC0_TK0 */
#define PIO_PC12E_SSC0_TK0                         (_UINT32_(1) << 12) /**< SSC0 signal: SSC0_TK0 */
/* ========== PIO definition for SSC1 peripheral ========== */
#define PIN_PA17B_SSC1_RD1                         _UINT32_(17) /**< SSC1 signal: SSC1_RD1 on PA17 mux B */
#define MUX_PA17B_SSC1_RD1                         _UINT32_(1)  /**< SSC1 signal line function value: SSC1_RD1 */
#define PIO_PA17B_SSC1_RD1                         (_UINT32_(1) << 17) /**< SSC1 signal: SSC1_RD1 */
#define PIN_PB17C_SSC1_RD1                         _UINT32_(49) /**< SSC1 signal: SSC1_RD1 on PB17 mux C */
#define MUX_PB17C_SSC1_RD1                         _UINT32_(2)  /**< SSC1 signal line function value: SSC1_RD1 */
#define PIO_PB17C_SSC1_RD1                         (_UINT32_(1) << 17) /**< SSC1 signal: SSC1_RD1 */
#define PIN_PA19B_SSC1_RF1                         _UINT32_(19) /**< SSC1 signal: SSC1_RF1 on PA19 mux B */
#define MUX_PA19B_SSC1_RF1                         _UINT32_(1)  /**< SSC1 signal line function value: SSC1_RF1 */
#define PIO_PA19B_SSC1_RF1                         (_UINT32_(1) << 19) /**< SSC1 signal: SSC1_RF1 */
#define PIN_PB19C_SSC1_RF1                         _UINT32_(51) /**< SSC1 signal: SSC1_RF1 on PB19 mux C */
#define MUX_PB19C_SSC1_RF1                         _UINT32_(2)  /**< SSC1 signal line function value: SSC1_RF1 */
#define PIO_PB19C_SSC1_RF1                         (_UINT32_(1) << 19) /**< SSC1 signal: SSC1_RF1 */
#define PIN_PA18B_SSC1_RK1                         _UINT32_(18) /**< SSC1 signal: SSC1_RK1 on PA18 mux B */
#define MUX_PA18B_SSC1_RK1                         _UINT32_(1)  /**< SSC1 signal line function value: SSC1_RK1 */
#define PIO_PA18B_SSC1_RK1                         (_UINT32_(1) << 18) /**< SSC1 signal: SSC1_RK1 */
#define PIN_PB18C_SSC1_RK1                         _UINT32_(50) /**< SSC1 signal: SSC1_RK1 on PB18 mux C */
#define MUX_PB18C_SSC1_RK1                         _UINT32_(2)  /**< SSC1 signal line function value: SSC1_RK1 */
#define PIO_PB18C_SSC1_RK1                         (_UINT32_(1) << 18) /**< SSC1 signal: SSC1_RK1 */
#define PIN_PA16B_SSC1_TD1                         _UINT32_(16) /**< SSC1 signal: SSC1_TD1 on PA16 mux B */
#define MUX_PA16B_SSC1_TD1                         _UINT32_(1)  /**< SSC1 signal line function value: SSC1_TD1 */
#define PIO_PA16B_SSC1_TD1                         (_UINT32_(1) << 16) /**< SSC1 signal: SSC1_TD1 */
#define PIN_PB16C_SSC1_TD1                         _UINT32_(48) /**< SSC1 signal: SSC1_TD1 on PB16 mux C */
#define MUX_PB16C_SSC1_TD1                         _UINT32_(2)  /**< SSC1 signal line function value: SSC1_TD1 */
#define PIO_PB16C_SSC1_TD1                         (_UINT32_(1) << 16) /**< SSC1 signal: SSC1_TD1 */
#define PIN_PA15B_SSC1_TF1                         _UINT32_(15) /**< SSC1 signal: SSC1_TF1 on PA15 mux B */
#define MUX_PA15B_SSC1_TF1                         _UINT32_(1)  /**< SSC1 signal line function value: SSC1_TF1 */
#define PIO_PA15B_SSC1_TF1                         (_UINT32_(1) << 15) /**< SSC1 signal: SSC1_TF1 */
#define PIN_PB15C_SSC1_TF1                         _UINT32_(47) /**< SSC1 signal: SSC1_TF1 on PB15 mux C */
#define MUX_PB15C_SSC1_TF1                         _UINT32_(2)  /**< SSC1 signal line function value: SSC1_TF1 */
#define PIO_PB15C_SSC1_TF1                         (_UINT32_(1) << 15) /**< SSC1 signal: SSC1_TF1 */
#define PIN_PA14B_SSC1_TK1                         _UINT32_(14) /**< SSC1 signal: SSC1_TK1 on PA14 mux B */
#define MUX_PA14B_SSC1_TK1                         _UINT32_(1)  /**< SSC1 signal line function value: SSC1_TK1 */
#define PIO_PA14B_SSC1_TK1                         (_UINT32_(1) << 14) /**< SSC1 signal: SSC1_TK1 */
#define PIN_PB14C_SSC1_TK1                         _UINT32_(46) /**< SSC1 signal: SSC1_TK1 on PB14 mux C */
#define MUX_PB14C_SSC1_TK1                         _UINT32_(2)  /**< SSC1 signal line function value: SSC1_TK1 */
#define PIO_PB14C_SSC1_TK1                         (_UINT32_(1) << 14) /**< SSC1 signal: SSC1_TK1 */
/* ========== PIO definition for TC0 peripheral ========== */
#define PIN_PA21D_TC0_TCLK0                        _UINT32_(21) /**< TC0 signal: TC0_TCLK0 on PA21 mux D */
#define MUX_PA21D_TC0_TCLK0                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TCLK0 */
#define PIO_PA21D_TC0_TCLK0                        (_UINT32_(1) << 21) /**< TC0 signal: TC0_TCLK0 */
#define PIN_PA29A_TC0_TCLK1                        _UINT32_(29) /**< TC0 signal: TC0_TCLK1 on PA29 mux A */
#define MUX_PA29A_TC0_TCLK1                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PA29A_TC0_TCLK1                        (_UINT32_(1) << 29) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PC5C_TC0_TCLK1                         _UINT32_(69) /**< TC0 signal: TC0_TCLK1 on PC5 mux C */
#define MUX_PC5C_TC0_TCLK1                         _UINT32_(2)  /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PC5C_TC0_TCLK1                         (_UINT32_(1) << 5) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PD13A_TC0_TCLK1                        _UINT32_(109) /**< TC0 signal: TC0_TCLK1 on PD13 mux A */
#define MUX_PD13A_TC0_TCLK1                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TCLK1 */
#define PIO_PD13A_TC0_TCLK1                        (_UINT32_(1) << 13) /**< TC0 signal: TC0_TCLK1 */
#define PIN_PB5A_TC0_TCLK2                         _UINT32_(37) /**< TC0 signal: TC0_TCLK2 on PB5 mux A */
#define MUX_PB5A_TC0_TCLK2                         _UINT32_(0)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PB5A_TC0_TCLK2                         (_UINT32_(1) << 5) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PB24D_TC0_TCLK2                        _UINT32_(56) /**< TC0 signal: TC0_TCLK2 on PB24 mux D */
#define MUX_PB24D_TC0_TCLK2                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PB24D_TC0_TCLK2                        (_UINT32_(1) << 24) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PD22A_TC0_TCLK2                        _UINT32_(118) /**< TC0 signal: TC0_TCLK2 on PD22 mux A */
#define MUX_PD22A_TC0_TCLK2                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TCLK2 */
#define PIO_PD22A_TC0_TCLK2                        (_UINT32_(1) << 22) /**< TC0 signal: TC0_TCLK2 */
#define PIN_PA19D_TC0_TIOA0                        _UINT32_(19) /**< TC0 signal: TC0_TIOA0 on PA19 mux D */
#define MUX_PA19D_TC0_TIOA0                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOA0 */
#define PIO_PA19D_TC0_TIOA0                        (_UINT32_(1) << 19) /**< TC0 signal: TC0_TIOA0 */
#define PIN_PA27A_TC0_TIOA1                        _UINT32_(27) /**< TC0 signal: TC0_TIOA1 on PA27 mux A */
#define MUX_PA27A_TC0_TIOA1                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PA27A_TC0_TIOA1                        (_UINT32_(1) << 27) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PC3C_TC0_TIOA1                         _UINT32_(67) /**< TC0 signal: TC0_TIOA1 on PC3 mux C */
#define MUX_PC3C_TC0_TIOA1                         _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PC3C_TC0_TIOA1                         (_UINT32_(1) << 3) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PD11A_TC0_TIOA1                        _UINT32_(107) /**< TC0 signal: TC0_TIOA1 on PD11 mux A */
#define MUX_PD11A_TC0_TIOA1                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOA1 */
#define PIO_PD11A_TC0_TIOA1                        (_UINT32_(1) << 11) /**< TC0 signal: TC0_TIOA1 */
#define PIN_PB6A_TC0_TIOA2                         _UINT32_(38) /**< TC0 signal: TC0_TIOA2 on PB6 mux A */
#define MUX_PB6A_TC0_TIOA2                         _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PB6A_TC0_TIOA2                         (_UINT32_(1) << 6) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PB22D_TC0_TIOA2                        _UINT32_(54) /**< TC0 signal: TC0_TIOA2 on PB22 mux D */
#define MUX_PB22D_TC0_TIOA2                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PB22D_TC0_TIOA2                        (_UINT32_(1) << 22) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PD20A_TC0_TIOA2                        _UINT32_(116) /**< TC0 signal: TC0_TIOA2 on PD20 mux A */
#define MUX_PD20A_TC0_TIOA2                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOA2 */
#define PIO_PD20A_TC0_TIOA2                        (_UINT32_(1) << 20) /**< TC0 signal: TC0_TIOA2 */
#define PIN_PA20D_TC0_TIOB0                        _UINT32_(20) /**< TC0 signal: TC0_TIOB0 on PA20 mux D */
#define MUX_PA20D_TC0_TIOB0                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOB0 */
#define PIO_PA20D_TC0_TIOB0                        (_UINT32_(1) << 20) /**< TC0 signal: TC0_TIOB0 */
#define PIN_PA28A_TC0_TIOB1                        _UINT32_(28) /**< TC0 signal: TC0_TIOB1 on PA28 mux A */
#define MUX_PA28A_TC0_TIOB1                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PA28A_TC0_TIOB1                        (_UINT32_(1) << 28) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PC4C_TC0_TIOB1                         _UINT32_(68) /**< TC0 signal: TC0_TIOB1 on PC4 mux C */
#define MUX_PC4C_TC0_TIOB1                         _UINT32_(2)  /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PC4C_TC0_TIOB1                         (_UINT32_(1) << 4) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PD12A_TC0_TIOB1                        _UINT32_(108) /**< TC0 signal: TC0_TIOB1 on PD12 mux A */
#define MUX_PD12A_TC0_TIOB1                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOB1 */
#define PIO_PD12A_TC0_TIOB1                        (_UINT32_(1) << 12) /**< TC0 signal: TC0_TIOB1 */
#define PIN_PB7A_TC0_TIOB2                         _UINT32_(39) /**< TC0 signal: TC0_TIOB2 on PB7 mux A */
#define MUX_PB7A_TC0_TIOB2                         _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PB7A_TC0_TIOB2                         (_UINT32_(1) << 7) /**< TC0 signal: TC0_TIOB2 */
#define PIN_PB23D_TC0_TIOB2                        _UINT32_(55) /**< TC0 signal: TC0_TIOB2 on PB23 mux D */
#define MUX_PB23D_TC0_TIOB2                        _UINT32_(3)  /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PB23D_TC0_TIOB2                        (_UINT32_(1) << 23) /**< TC0 signal: TC0_TIOB2 */
#define PIN_PD21A_TC0_TIOB2                        _UINT32_(117) /**< TC0 signal: TC0_TIOB2 on PD21 mux A */
#define MUX_PD21A_TC0_TIOB2                        _UINT32_(0)  /**< TC0 signal line function value: TC0_TIOB2 */
#define PIO_PD21A_TC0_TIOB2                        (_UINT32_(1) << 21) /**< TC0 signal: TC0_TIOB2 */
/* ========== PIO definition for TC1 peripheral ========== */
#define PIN_PB8A_TC1_TCLK3                         _UINT32_(40) /**< TC1 signal: TC1_TCLK3 on PB8 mux A */
#define MUX_PB8A_TC1_TCLK3                         _UINT32_(0)  /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PB8A_TC1_TCLK3                         (_UINT32_(1) << 8) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PB21D_TC1_TCLK3                        _UINT32_(53) /**< TC1 signal: TC1_TCLK3 on PB21 mux D */
#define MUX_PB21D_TC1_TCLK3                        _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PB21D_TC1_TCLK3                        (_UINT32_(1) << 21) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PD31D_TC1_TCLK3                        _UINT32_(127) /**< TC1 signal: TC1_TCLK3 on PD31 mux D */
#define MUX_PD31D_TC1_TCLK3                        _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK3 */
#define PIO_PD31D_TC1_TCLK3                        (_UINT32_(1) << 31) /**< TC1 signal: TC1_TCLK3 */
#define PIN_PA11D_TC1_TCLK4                        _UINT32_(11) /**< TC1 signal: TC1_TCLK4 on PA11 mux D */
#define MUX_PA11D_TC1_TCLK4                        _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PA11D_TC1_TCLK4                        (_UINT32_(1) << 11) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PC11D_TC1_TCLK4                        _UINT32_(75) /**< TC1 signal: TC1_TCLK4 on PC11 mux D */
#define MUX_PC11D_TC1_TCLK4                        _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK4 */
#define PIO_PC11D_TC1_TCLK4                        (_UINT32_(1) << 11) /**< TC1 signal: TC1_TCLK4 */
#define PIN_PA8D_TC1_TCLK5                         _UINT32_(8)  /**< TC1 signal: TC1_TCLK5 on PA8 mux D */
#define MUX_PA8D_TC1_TCLK5                         _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PA8D_TC1_TCLK5                         (_UINT32_(1) << 8) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PB30D_TC1_TCLK5                        _UINT32_(62) /**< TC1 signal: TC1_TCLK5 on PB30 mux D */
#define MUX_PB30D_TC1_TCLK5                        _UINT32_(3)  /**< TC1 signal line function value: TC1_TCLK5 */
#define PIO_PB30D_TC1_TCLK5                        (_UINT32_(1) << 30) /**< TC1 signal: TC1_TCLK5 */
#define PIN_PB9A_TC1_TIOA3                         _UINT32_(41) /**< TC1 signal: TC1_TIOA3 on PB9 mux A */
#define MUX_PB9A_TC1_TIOA3                         _UINT32_(0)  /**< TC1 signal line function value: TC1_TIOA3 */
